<!DOCTYPE html>
<html lang="en">
<head>
    <title>
&#x410;&#x43D;&#x434;&#x440;&#x435;&#x439; &#x410;&#x43A;&#x438;&#x43D;&#x44C;&#x448;&#x438;&#x43D; &#x2014; &#x41F;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x43C; &#x43F;&#x440;&#x43E; &#x43F;&#x435;&#x440;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43D;&#x441;-&#x430;&#x43D;&#x430;&#x43B;&#x438;&#x437; - linksfor.dev(s)    </title>
    <meta charset="utf-8">
    <link rel="alternate" type="application/rss+xml" title="Linksfor.dev(s) feed" href="https://linksfor.dev/feed.rss" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="google" value="notranslate">
    <link rel="stylesheet" type="text/css" href="/style.css" />
    <link rel="shortcut icon" href="/favicon.ico" type="image/x-icon">
    <link rel="icon" href="/favicon.ico" type="image/x-icon">
    <meta property="og:title" content="&#x410;&#x43D;&#x434;&#x440;&#x435;&#x439; &#x410;&#x43A;&#x438;&#x43D;&#x44C;&#x448;&#x438;&#x43D; &#x2014; &#x41F;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x43C; &#x43F;&#x440;&#x43E; &#x43F;&#x435;&#x440;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43D;&#x441;-&#x430;&#x43D;&#x430;&#x43B;&#x438;&#x437; - linksfor.dev(s)"/>
    <meta property="article:author" content="DotNext"/>
    <meta property="og:description" content="&#x411;&#x43B;&#x438;&#x436;&#x430;&#x439;&#x448;&#x430;&#x44F; &#x43A;&#x43E;&#x43D;&#x444;&#x435;&#x440;&#x435;&#x43D;&#x446;&#x438;&#x44F; &#x2014; DotNext 2020 Moscow&#xA;2-5 &#x434;&#x435;&#x43A;&#x430;&#x431;&#x440;&#x44F;, Online&#xA;&#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x438; &#x431;&#x438;&#x43B;&#x435;&#x442;&#x44B;: https://dotnext-moscow.ru/&#xA;&#xA;. &#x41A;&#x43E;&#x433;&#x434;&#x430; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x440;&#x430;&#x437;&#x433;&#x43E;&#x432;&#x43E;&#x440; &#x43F;&#x440;&#x43E; &#x43F;&#x435;&#x440;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43D;&#x441;-&#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;, &#x442;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x441;&#x442;&#x43E;&#x432; &#x440;&#x430;&#x437;&#x43C;&#x44B;&#x448;&#x43B;&#x44F;&#x435;&#x442; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43E; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x438; &#x437;&#x430;&#x43C;&#x435;&#x440;&#x43E;&#x432; &#x438; &#x441;&#x431;&#x43E;&#x440;&#x435; &#x43C;&#x435;&#x442;&#x440;&#x438;&#x43A;, &#x432; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; &#x43D;&#x430;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x430;&#x436;&#x43D;&#x435;&#x435; &#x437;&#x430;&#x434;&#x443;&#x43C;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x431; &#x430;&#x43D;&#x430;&#x43B;&#x438;&#x437;&#x435; &#x441;&#x43E;&#x431;&#x440;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439;. &#x41F;&#x43E;&#x43D;&#x44F;&#x442;&#x44C;, &#x43A;&#x430;&#x43A; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438;&#x437;&#x43C;&#x435;&#x440;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43C;&#x435;&#x442;&#x440;&#x438;&#x43A;&#x438; &#x438; &#x438;&#x437;&#x432;&#x43B;&#x435;&#x447;&#x44C; &#x438;&#x437; &#x43D;&#x438;&#x445; &#x43C;&#x430;&#x43A;&#x441;&#x438;&#x43C;&#x443;&#x43C; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x44B;, &#x2014; &#x43D;&#x435; &#x442;&#x430;&#x43A;&#x430;&#x44F; &#x443;&#x436; &#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x430;&#x44F; &#x437;&#x430;&#x434;&#x430;&#x447;&#x430;. &#x412; &#x44D;&#x442;&#x43E;&#x43C; &#x434;&#x43E;&#x43A;&#x43B;&#x430;&#x434;&#x435; &#x43C;&#x44B; &#x43E;&#x431;&#x441;&#x443;&#x434;&#x438;&#x43C; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x44B;&#x435; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438; &#x438; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43D;&#x441;-&#x430;&#x43D;&#x430;&#x43B;&#x438;&#x437;&#x430;: &#x43F;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x43C; &#x43E; &#x442;&#x43E;&#x43C;, &#x43A;&#x430;&#x43A; &#x438;&#x437;&#x443;&#x447;&#x430;&#x442;&#x44C; &#x441;&#x44B;&#x440;&#x44B;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x438; &#x441;&#x432;&#x43E;&#x434;&#x43D;&#x44B;&#x435; &#x43C;&#x435;&#x442;&#x440;&#x438;&#x43A;&#x438;, &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C; &#x441;&#x442;&#x430;&#x442;&#x438;&#x441;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435; &#x442;&#x435;&#x441;&#x442;&#x44B;, &#x441;&#x440;&#x430;&#x432;&#x43D;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43D;&#x441;&#x43D;&#x44B;&#x435; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F;, &#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43D;&#x441;&#x43D;&#x44B;&#x435; &#x442;&#x435;&#x441;&#x442;&#x44B;, &#x430;&#x43D;&#x430;&#x43B;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x44E; &#x437;&#x430;&#x43C;&#x435;&#x440;&#x43E;&#x432; &#x438; &#x432;&#x44B;&#x431;&#x438;&#x440;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43C;&#x435;&#x442;&#x440;&#x438;&#x43A;&#x438;.&#xA;&#xA;&#x410;&#x43D;&#x434;&#x440;&#x435;&#x439; &#x410;&#x43A;&#x438;&#x43D;&#x44C;&#x448;&#x438;&#x43D; (JetBrains).&#xA;&#x41B;&#x44E;&#x431;&#x438;&#x43C;&#x44B;&#x435; &#x442;&#x435;&#x43C;&#x44B; &#x410;&#x43D;&#x434;&#x440;&#x435;&#x44F; &#x2014; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x438; &#x43C;&#x438;&#x43A;&#x440;&#x43E;&#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;, &#x43E;&#x43D; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43C;&#x435;&#x439;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x430; BenchmarkDotNet (&#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; .NET-&#x431;&#x435;&#x43D;&#x447;&#x43C;&#x430;&#x440;&#x43A;&#x43E;&#x432;, &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x430;&#x43D;&#x43D;&#x430;&#x44F; .NET Foundation). &#x410;&#x43D;&#x434;&#x440;&#x435;&#x439; &#x2014; &#x447;&#x430;&#x441;&#x442;&#x44B;&#x439; &#x441;&#x43F;&#x438;&#x43A;&#x435;&#x440; &#x43D;&#x430; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x43C;&#x435;&#x440;&#x43E;&#x43F;&#x440;&#x438;&#x44F;&#x442;&#x438;&#x44F;&#x445; &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432; &#x438; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x435;&#x434;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43C;&#x438;&#x442;&#x435;&#x442;&#x430; &#x43A;&#x43E;&#x43D;&#x444;&#x435;&#x440;&#x435;&#x43D;&#x446;&#x438;&#x438; DotNext. &#x41E;&#x43D; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43A;.&#x444;.-&#x43C;.&#x43D;., &#x441;&#x435;&#x440;&#x435;&#x431;&#x440;&#x44F;&#x43D;&#x44B;&#x439; &#x43C;&#x435;&#x434;&#x430;&#x43B;&#x438;&#x441;&#x442; ACM ICPC. &#x412; &#x441;&#x432;&#x43E;&#x431;&#x43E;&#x434;&#x43D;&#x43E;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43B;&#x44E;&#x431;&#x438;&#x442; &#x437;&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430;&#x443;&#x43A;&#x43E;&#x439;, &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x44B;&#x435; &#x43D;&#x430;&#x443;&#x447;&#x43D;&#x44B;&#x435; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x44B; &#x2014; &#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x430;&#x44F; &#x431;&#x438;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x44F; &#x438; &#x442;&#x435;&#x43E;&#x440;&#x438;&#x44F; &#x431;&#x438;&#x444;&#x443;&#x440;&#x43A;&#x430;&#x446;&#x438;&#x439;. &#x420;&#x430;&#x43D;&#x44C;&#x448;&#x435; &#x43E;&#x43D; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43B; &#x43F;&#x43E;&#x441;&#x442;&#x434;&#x43E;&#x43A;&#x43E;&#x43C; &#x432; &#x418;&#x43D;&#x441;&#x442;&#x438;&#x442;&#x443;&#x442;&#x435; &#x412;&#x435;&#x439;&#x446;&#x43C;&#x430;&#x43D;&#x430; &#x438; &#x43D;&#x430;&#x443;&#x447;&#x43D;&#x44B;&#x43C; &#x441;&#x43E;&#x442;&#x440;&#x443;&#x434;&#x43D;&#x438;&#x43A;&#x43E;&#x43C; &#x432; &#x418;&#x43D;&#x441;&#x442;&#x438;&#x442;&#x443;&#x442;&#x435; &#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x43A;&#x438; &#x421;&#x41E; &#x420;&#x410;&#x41D;.&#xA;&#xA;Royalty Free Music from Bensound &#xA;https://www.bensound.com/royalty-free-music/track/ukulele"/>
    <meta property="og:type" content="website"/>
    <meta property="og:url" content="https://www.youtube.com/watch?v=-IZx1lT2vAQ"/>

<meta property="og:site_name" content="linksfor.dev(s)" />
</head>
<body>
    <div class="devring" style="background: #222">
        <div style="text-align:center">Explore other dev related sites in this ring. If you would like to join this ring <a href="https://devring.club">click here</a>.</div>
        <div class="grid">
            <div style="display: grid; grid-template-columns: .5fr 1fr 1fr 1fr; text-align: center;">
                <span class="devring-title"><a href="https://devring.club/">devring.club</a></span>
                <a href="https://devring.club/sites/1/prev" class="devring-previous">Previous</a>
                <a href="https://devring.club/random" class="devring-random">Random</a>
                <a href="https://devring.club/sites/1/next" class="devring-next">Next</a>
            </div>
        </div>
    </div>
    <div class="grid">
        <h1>
<a href="/" style="color:inherit">linksfor.dev(s)</a>
        </h1>
        <title>linksfor.dev(s) - &#x410;&#x43D;&#x434;&#x440;&#x435;&#x439; &#x410;&#x43A;&#x438;&#x43D;&#x44C;&#x448;&#x438;&#x43D; &#x2014; &#x41F;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x43C; &#x43F;&#x440;&#x43E; &#x43F;&#x435;&#x440;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43D;&#x441;-&#x430;&#x43D;&#x430;&#x43B;&#x438;&#x437;</title>
<div class="readable">
        <h1>&#x410;&#x43D;&#x434;&#x440;&#x435;&#x439; &#x410;&#x43A;&#x438;&#x43D;&#x44C;&#x448;&#x438;&#x43D; &#x2014; &#x41F;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x43C; &#x43F;&#x440;&#x43E; &#x43F;&#x435;&#x440;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x43D;&#x441;-&#x430;&#x43D;&#x430;&#x43B;&#x438;&#x437;</h1>
            <div>by DotNext</div>
            <div>Watching time: 70 minutes</div>
        <div>Posted here: 29 Jul 2020</div>
        <p><a href="https://www.youtube.com/watch?v=-IZx1lT2vAQ">https://www.youtube.com/watch?v=-IZx1lT2vAQ</a></p>
        <iframe allowFullScreen="allowFullScreen" src="https://www.youtube-nocookie.com/embed/-IZx1lT2vAQ?ecver=1&amp;iv_load_policy=1&amp;yt:stretch=16:9&amp;autohide=1&amp;color=red&amp;width=980" width="980" height="600" allowtransparency="true" frameborder="0"></iframe>
        <br />
        <p style="text-align:left">
            Ближайшая конференция — DotNext 2020 Moscow
2-5 декабря, Online
Подробности и билеты: https://dotnext-moscow.ru/

. Когда начинается разговор про перформанс-тестирование, то большинство программистов размышляет только о проведении замеров и сборе метрик, в то время как намного важнее задуматься об анализе собранных значений. Понять, как правильно использовать измеренные метрики и извлечь из них максимум пользы, — не такая уж и простая задача. В этом докладе мы обсудим основные задачи и сложности перформанс-анализа: поговорим о том, как изучать сырые данные и сводные метрики, применять статистические тесты, сравнивать перформансные распределения, писать перформансные тесты, анализировать историю замеров и выбирать правильные метрики.

Андрей Акиньшин (JetBrains).
Любимые темы Андрея — производительность и микрооптимизации, он также мейнтейнер проекта BenchmarkDotNet (библиотека для написания .NET-бенчмарков, поддержанная .NET Foundation). Андрей — частый спикер на различных мероприятиях для разработчиков и председатель программного комитета конференции DotNext. Он также к.ф.-м.н., серебряный медалист ACM ICPC. В свободное время любит заниматься наукой, основные научные интересы — математическая биология и теория бифуркаций. Раньше он работал постдоком в Институте Вейцмана и научным сотрудником в Институте математики СО РАН.

Royalty Free Music from Bensound 
https://www.bensound.com/royalty-free-music/track/ukulele
        </p>
</div>
    </div>
    <footer>
        <div>created by <a href="https://buildstarted.com">buildstarted</a> &copy; 2020 <a href="/about">about</a></div>
        <div>Share this page on social media: copy and paste this url https://linksfor.dev/</div>
        <div>If you prefer RSS: <a href="https://linksfor.dev/feed.xml">https://linksfor.dev/feed.xml</a></div>
        <div>Customer satisfaction guaranteed to be optional.</div>
    </footer>
    
    <script async defer>
        _dna = window._dna || {};
        _dna.siteId = "linksfor.devs";
        _dna.outlink = true;

        (function() {
            let dna = document.createElement('script');
            dna.type = 'text/javascript';
            dna.async = true;
            dna.src = '//dna.buildstarted.com/t.js';
            let s = document.getElementsByTagName('script')[0];
            s.parentNode.insertBefore(dna, s);
        })();
    </script>
    <noscript><img src="//dna.buildstarted.com/g?siteId=linksfor.devs"/></noscript>
</body>
</html>