<!DOCTYPE html>
<html lang="en">
<head>
    <title>
&#x41B;&#x443;&#x447;&#x448;&#x438;&#x435; &#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x437;&#x430; &#x441;&#x443;&#x442;&#x43A;&#x438; / &#x425;&#x430;&#x431;&#x440; -
linksfor.dev(s)
    </title>
    <meta charset="utf-8">
    <meta name="Description" content="A curated source of links that devs might find interesting. Updated around the clock." />
    <meta name="google" value="notranslate">
    <style type="text/css">
        html {
            font-family: sans-serif;
            line-height: 1.15;
            -webkit-text-size-adjust: 100%;
            -webkit-tap-highlight-color: transparent;
            height: 100%;
        }

        *, ::after, ::before {
            box-sizing: border-box;
        }

        body {
            margin: 0;
            font-family: -apple-system,BlinkMacSystemFont,"Segoe UI",Roboto,"Helvetica Neue",Arial,"Noto Sans",sans-serif,"Apple Color Emoji","Segoe UI Emoji","Segoe UI Symbol","Noto Color Emoji";
            font-size: 1rem;
            font-weight: 400;
            line-height: 1.5;
            color: #60656a;
            text-align: left;
            background-color: #323b44;
        }

        h1 {
            font-size: 6rem;
            font-weight: 300;
            line-height: 1.2;
            margin-top: 0;
            margin-bottom: 0.5rem;
            margin-bottom: 0.5rem
        }

        a {
            color: #007bff;
            color: #ccc;
            text-decoration: none;
            background-color: transparent;
            word-break: break-all;
        }

        .unseen a {
            font-weight: bold;
        }

        h3 {
            margin-top: 0;
            padding-top: 0;
            font-weight: normal;
        }

        .grid {
            -ms-flex-direction: column;
            flex-direction: column;
            width: 1024px;
            margin: 0 auto;
            flex: 1 0 auto;
        }

        .row {
            -ms-flex-direction: row;
            flex-direction: row;
            width: 100%;
            -ms-flex-wrap: wrap;
            flex-wrap: wrap;
            display: -ms-flexbox;
            display: flex;
        }

        .col {
            margin: 0 10px 0 10px;
            box-sizing: border-box;
            vertical-align: top;
        }

        .col-3-of-4, .col-6-of-8, .col-9-of-12 {
            width: calc(75% - 20px);
        }

        .col-1-of-4, .col-2-of-8, .col-3-of-12 {
            width: calc(25% - 20px);
        }

        @media (max-width:1023px) {
            /* big landscape tablets, laptops, and desktops */
            body {
                overflow-x: hidden;
            }

            main {
                width: 99%;
            }

            h1 {
                font-size: 50px;
            }
        }

        .text-right {
            text-align: right;
        }

        footer {
            left: 0;
            width: 100%;
            margin-top: 2em;
            padding: 50px 0;
            text-align: center;
            -moz-box-sizing: border-box;
            -webkit-box-sizing: border-box;
            box-sizing: border-box;
        }

        .readable {
            color: #949ba2;
        }

        svg:not(:root).svg-inline--fa {
            color: #60656a;
            overflow: visible;
        }

        .svg-inline--fa.fa-w-12 {
            width: 0.75em;
        }

        svg:not(:root) {
            overflow: hidden;
        }

        .svg-inline--fa {
            display: inline-block;
            font-size: inherit;
            height: 1em;
            overflow: visible;
            vertical-align: -0.125em;
        }

        img {
            max-width: 100%;
        }

        .text-center {
            text-align: center;
        }

        .readable h1 {
            font-size: 2em;
        }
    </style>
</head>
<body>
    <div class="grid">
        
<div class="readable">
    <h1>&#x41B;&#x443;&#x447;&#x448;&#x438;&#x435; &#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x437;&#x430; &#x441;&#x443;&#x442;&#x43A;&#x438; / &#x425;&#x430;&#x431;&#x440;</h1>
    <div class="layout__row layout__row_body"> <p class="layout__cell"> <section class="column-wrapper column-wrapper_lists js-sticky-wrapper"> <div class="content_left js-content_left"> <div class="posts_list"> <ul class="content-list content-list_posts shortcuts_items"> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455154"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article">&#x414;&#x43E;&#x431;&#x440;&#x43E;&#x433;&#x43E; &#x434;&#x43D;&#x44F; &#x434;&#x43E;&#x440;&#x43E;&#x433;&#x438;&#x435; &#x425;&#x430;&#x431;&#x440;&#x43E;&#x432;&#x447;&#x430;&#x43D;&#x435;! &#x421;&#x435;&#x433;&#x43E;&#x434;&#x43D;&#x44F;&#x448;&#x43D;&#x44F;&#x44F; &#x43C;&#x43E;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44F; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x43E;&#x441;&#x432;&#x44F;&#x449;&#x435;&#x43D;&#x430; &#x442;&#x435;&#x43C;&#x435; &#xAB;&#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x439; &#x44D;&#x43D;&#x435;&#x440;&#x433;&#x435;&#x442;&#x438;&#x43A;&#x438;&#xBB; &#x2014; &#x442;&#x43E;&#x447;&#x43D;&#x435;&#x435; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B; &#x44D;&#x43B;&#x435;&#x43A;&#x442;&#x440;&#x43E;&#x43F;&#x438;&#x442;&#x430;&#x43D;&#x438;&#x44F; &#x434;&#x435;&#x440;&#x435;&#x432;&#x435;&#x43D;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x43C;&#x430; &#x43E;&#x442; &#x441;&#x43E;&#x43B;&#x43D;&#x435;&#x447;&#x43D;&#x44B;&#x445; &#x431;&#x430;&#x442;&#x430;&#x440;&#x435;&#x439;. &#x42F; &#x43D;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x441;&#x44C; &#x43A;&#x430;&#x43A;&#x438;&#x43C;-&#x442;&#x43E; &#xAB;&#x443;&#x448;&#x438;&#x431;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x43D;&#x430; &#x432;&#x441;&#x44E; &#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x443; &#x413;&#x440;&#x438;&#x43D;&#x43F;&#x438;&#x441;&#x43E;&#x432;&#x446;&#x435;&#x43C;&#xBB; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C;&#x443; &#x436;&#x438;&#x442;&#x44C; &#x43D;&#x430; &#x441;&#x432;&#x435;&#x442;&#x435; &#x43D;&#x438;&#x43A;&#x430;&#x43A; &#x43E;&#x442; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E; &#x438;&#x437; &#x441;&#x432;&#x438;&#x43D;&#x435;&#x439; &#x434;&#x435;&#x43B;&#x430;&#x44E;&#x442; &#x43A;&#x43E;&#x442;&#x43B;&#x435;&#x442;&#x44B;. &#x41F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x439; &#x44D;&#x43D;&#x435;&#x440;&#x433;&#x435;&#x442;&#x438;&#x43A;&#x43E;&#x439; &#x44F; &#x437;&#x430;&#x43D;&#x44F;&#x43B;&#x441;&#x44F; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x432;&#x44B;&#x43D;&#x443;&#x436;&#x434;&#x435;&#x43D;&#x43D;&#x43E;, &#x43F;&#x43E; &#x441;&#x435;&#x440;&#x44C;&#x435;&#x437;&#x43D;&#x43E;&#x43C;&#x443; &#x437;&#x430;&#x43D;&#x44F;&#x43B;&#x441;&#x44F;. &#xAB;&#x414;&#x435;&#x442;&#x441;&#x43A;&#x438;&#x435; &#x438;&#x433;&#x440;&#x44B;&#xBB; &#x432; &#x432;&#x438;&#x434;&#x435; &#x43F;&#x43E;&#x43A;&#x443;&#x43F;&#x43A;&#x438; &#x438; &#x434;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43E; &#x443;&#x43C;&#x430; &#x441;&#x430;&#x434;&#x43E;&#x432;&#x44B;&#x445; &#x444;&#x43E;&#x43D;&#x430;&#x440;&#x438;&#x43A;&#x43E;&#x432; &#x43D;&#x430; &#x441;&#x43E;&#x43B;&#x43D;&#x435;&#x447;&#x43D;&#x44B;&#x445; &#x43F;&#x430;&#x43D;&#x435;&#x43B;&#x44F;&#x445; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x434;&#x43D;&#x435;&#x43C; &#x437;&#x430;&#x440;&#x44F;&#x436;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x43A;&#x43B;&#x443;&#x43C;&#x431;&#x435; &#x441; &#x446;&#x432;&#x435;&#x442;&#x430;&#x43C;&#x438; &#x438;&#x43B;&#x438; &#x43D;&#x430; &#x437;&#x430;&#x431;&#x43E;&#x440;&#x435;, &#x430; &#x432;&#x435;&#x447;&#x435;&#x440;&#x43E;&#x43C; &#x437;&#x430;&#x43D;&#x43E;&#x441;&#x44F;&#x442;&#x441;&#x44F; &#x432; &#x434;&#x43E;&#x43C; &#x43F;&#x43E;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x43D;&#x43E;&#x447;&#x43D;&#x438;&#x43A;&#x430;&#x43C;&#x438; &#x2014; &#x44D;&#x442;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x441; &#x442;&#x435;&#x445; &#x441;&#x430;&#x43C;&#x44B;&#x445; &#x43F;&#x43E;&#x440; &#x43A;&#x430;&#x43A; &#x438;&#x445; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x43C;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43D;&#x430;&#x445; &#x431;&#x43B;&#x438;&#x437;&#x43B;&#x435;&#x436;&#x430;&#x449;&#x435;&#x433;&#x43E; &#x433;&#x43E;&#x440;&#x43E;&#x434;&#x430;. &#x421;&#x435;&#x439;&#x447;&#x430;&#x441; &#x44F; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x436;&#x443; &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x441;&#x430;&#x434;&#x43E;&#x432;&#x44B;&#x435; &#x444;&#x43E;&#x43D;&#x430;&#x440;&#x438;&#x43A;&#x438; &#x431;&#x440;&#x430;&#x442;&#x44C; &#x441;&#x442;&#x43E;&#x438;&#x442;, &#x430; &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x43D;&#x435; &#x441;&#x442;&#x43E;&#x438;&#x442;, &#x438; &#x447;&#x442;&#x43E; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x441; &#x442;&#x435;&#x43C;&#x438; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x432;&#x437;&#x44F;&#x43B;&#x438; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43E;&#x43D;&#x438; &#x432;&#x430;&#x43C; &#x43F;&#x440;&#x43E;&#x441;&#x43B;&#x443;&#x436;&#x438;&#x43B;&#x438; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x443;&#x43C; &#x43F;&#x430;&#x440;&#x443; &#x43B;&#x435;&#x442;. </div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/post/455154/#habracut">&#x41F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x438; &#x43F;&#x43E;&#x434; &#x43A;&#x430;&#x442;&#x43E;&#x43C;</a> </div> </article> </li> <li class="content-list__item content-list__item_news-block shortcuts_item"> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455132"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article">&#x412; &#x430;&#x43D;&#x433;&#x43B;&#x438;&#x439;&#x441;&#x43A;&#x43E;&#x43C; &#x44F;&#x437;&#x44B;&#x43A;&#x435; &#x435;&#x441;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x43E;&#x435; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x438;&#x435; &#x43A;&#x430;&#x43A; &#xAB;early adopter&#xBB;. &#x42F; &#x43D;&#x435; &#x443;&#x432;&#x435;&#x440;&#x435;&#x43D;, &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43B;&#x438; &#x435;&#x433;&#x43E; &#x430;&#x434;&#x435;&#x43A;&#x432;&#x430;&#x442;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43D;&#x430; &#x440;&#x443;&#x441;&#x441;&#x43A;&#x438;&#x439; &#x44F;&#x437;&#x44B;&#x43A;, &#x432; &#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x443; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x440;&#x430;&#x437;&#x432;&#x435; &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x43A;&#x430; &#xAB;&#x41F;&#x43E;&#x441;&#x43F;&#x435;&#x448;&#x438;&#x448;&#x44C; &#x2014; &#x43B;&#x44E;&#x434;&#x435;&#x439; &#x43D;&#x430;&#x441;&#x43C;&#x435;&#x448;&#x438;&#x448;&#x44C;&#xBB;. Early adopter &#x2014; &#x44D;&#x442;&#x43E; &#x44D;&#x43D;&#x442;&#x443;&#x437;&#x438;&#x430;&#x441;&#x442; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x439;, &#x436;&#x435;&#x43B;&#x430;&#x44E;&#x449;&#x438;&#x439; &#x438;&#x441;&#x43F;&#x44B;&#x442;&#x430;&#x442;&#x44C; &#x438;&#x445; &#x43D;&#x430; &#x441;&#x435;&#x431;&#x435; &#x43A;&#x430;&#x43A; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x440;&#x430;&#x43D;&#x44C;&#x448;&#x435;, &#x43D;&#x435; &#x434;&#x43E;&#x436;&#x438;&#x434;&#x430;&#x44F;&#x441;&#x44C; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x430; &#x43D;&#x435;&#x438;&#x437;&#x431;&#x435;&#x436;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x441;&#x442;&#x432;&#x430; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C; &#x438; &#x43A;&#x43E;&#x441;&#x44F;&#x43A;&#x43E;&#x432;. &#x412; 2007 &#x433;&#x43E;&#x434;&#x443; &#x442;&#x430;&#x43A;&#x438;&#x435; &#x44D;&#x43D;&#x442;&#x443;&#x437;&#x438;&#x430;&#x441;&#x442;&#x44B; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x437;&#x438;&#x43B;&#x438; &#x438;&#x437; &#x421;&#x428;&#x410; &#x437;&#x430;&#x43B;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43D;&#x430; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x438; &#x43D;&#x435;&#x440;&#x443;&#x441;&#x438;&#x444;&#x438;&#x446;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x435; &#x410;&#x439;&#x444;&#x43E;&#x43D;&#x44B;. &#x421;&#x435;&#x439;&#x447;&#x430;&#x441; &#x43E;&#x43D;&#x438; &#x43F;&#x43E;&#x43A;&#x443;&#x43F;&#x430;&#x44E;&#x442; &#x441;&#x43C;&#x430;&#x440;&#x442;&#x444;&#x43E;&#x43D;&#x44B; &#x441; &#x433;&#x438;&#x431;&#x43A;&#x438;&#x43C; &#x44D;&#x43A;&#x440;&#x430;&#x43D;&#x43E;&#x43C;, &#x43E;&#x441;&#x432;&#x430;&#x438;&#x432;&#x430;&#x44E;&#x442; 3D-&#x43F;&#x435;&#x447;&#x430;&#x442;&#x44C; &#x438; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x438; VR. <div><img src="https://habrastorage.org/webt/-e/d9/ct/-ed9ctkt_af5ienfscl6z_-qcco.jpeg"></div> &#x412; &#x43E;&#x431;&#x449;&#x435;&#x43C;, &#x443;&#x447;&#x430;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x442; &#x432; &#x431;&#x435;&#x442;&#x430;-&#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; &#x43F;&#x440;&#x43E;&#x434;&#x443;&#x43A;&#x442;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435;-&#x442;&#x43E; &#x43F;&#x43E;&#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x432; &#x43F;&#x440;&#x43E;&#x434;&#x430;&#x436;&#x435;, &#x43A;&#x430;&#x43A; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x44B;&#x435; &#x438; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;. &#x41D;&#x43E; &#x43D;&#x435;&#x442;. &#x421;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x432;&#x44B; &#x441;&#x442;&#x430;&#x43B;&#x43A;&#x438;&#x432;&#x430;&#x435;&#x442;&#x435;&#x441;&#x44C; &#x441; &#x432;&#x44B;&#x441;&#x43E;&#x43A;&#x438;&#x43C; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x43D;&#x442;&#x43E;&#x43C; &#x43E;&#x442;&#x43A;&#x430;&#x437;&#x43E;&#x432; &#x438;, &#x435;&#x441;&#x43B;&#x438; &#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x437;&#x43B;&#x43E;, &#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x43A;&#x443;&#x43F;&#x43A;&#x443; &#x43F;&#x43E; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x438;&#x438; &#x440;&#x430;&#x437;&#x430; &#x442;&#x440;&#x438;. &#x41F;&#x43E;&#x442;&#x43E;&#x43C; &#x43F;&#x44B;&#x442;&#x430;&#x435;&#x442;&#x435;&#x441;&#x44C; &#x43E;&#x431;&#x43E;&#x439;&#x442;&#x438; &#x43D;&#x435;&#x438;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43C;&#x44B;&#x435; &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43A;&#x438;: &#x442;&#x43E; &#x431;&#x430;&#x442;&#x430;&#x440;&#x435;&#x439;&#x43A;&#x430; &#x441;&#x44A;&#x435;&#x434;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x437;&#x430; &#x447;&#x430;&#x441;, &#x442;&#x43E; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x433;&#x43B;&#x44E;&#x447;&#x430;&#x442;, &#x442;&#x43E; &#x435;&#x449;&#x435; &#x447;&#x442;&#x43E;-&#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C;. &#x427;&#x435;&#x440;&#x435;&#x437; &#x433;&#x43E;&#x434; &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x432;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x43F;&#x43E;&#x43A;&#x43E;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;, &#x438; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x447;&#x430;&#x441;&#x44C;&#x435; &#x43F;&#x440;&#x435;&#x432;&#x440;&#x430;&#x449;&#x430;&#x44E;&#x442; &#x434;&#x43E;&#x440;&#x43E;&#x433;&#x443;&#x44E; &#x432;&#x435;&#x440;&#x448;&#x438;&#x43D;&#x443; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x435;&#x441;&#x441;&#x430; &#x432; &#x443;&#x441;&#x442;&#x430;&#x440;&#x435;&#x432;&#x448;&#x435;&#x435; &#x43C;&#x430;&#x43B;&#x43E;&#x43F;&#x440;&#x438;&#x433;&#x43E;&#x434;&#x43D;&#x43E;&#x435; &#x433;&#x43B;&#x44E;&#x447;&#x43D;&#x43E;&#x435; &#x43F;&#x43E;&#x434;&#x435;&#x43B;&#x438;&#x435; &#x43F;&#x440;&#x43E;&#x448;&#x43B;&#x43E;&#x433;&#x43E;. &#x41D;&#x43E; &#x432;&#x44B; &#x43D;&#x435; &#x436;&#x430;&#x43B;&#x443;&#x435;&#x442;&#x435;&#x441;&#x44C;. &#x422;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x436;&#x430;&#x43B;&#x443;&#x435;&#x442;&#x435;&#x441;&#x44C;, &#x43D;&#x43E; &#x432;&#x441;&#x435; &#x440;&#x430;&#x432;&#x43D;&#x43E; &#x440;&#x430;&#x434;&#x44B;: &#x432;&#x435;&#x434;&#x44C; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x43D;&#x438; &#x443; &#x43A;&#x43E;&#x433;&#x43E; &#x43D;&#x435;&#x442;, &#x430; &#x443; &#x432;&#x430;&#x441; &#x435;&#x441;&#x442;&#x44C;. &#x412; 1996 &#x433;&#x43E;&#x434;&#x443; Microsoft &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442; &#x43C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x43D;&#x43E;&#x435; &#x43D;&#x430;&#x441;&#x442;&#x443;&#x43F;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x440;&#x44B;&#x43D;&#x43E;&#x43A; &#x43D;&#x43E;&#x441;&#x438;&#x43C;&#x44B;&#x445; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;. &#x412; 1997 &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x44F;&#x442; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43A;&#x43E;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x2014; &#x43A;&#x43B;&#x430;&#x432;&#x438;&#x430;&#x442;&#x443;&#x440;&#x43D;&#x44B;&#x435; &#x41A;&#x41F;&#x41A;. &#x421;&#x440;&#x435;&#x434;&#x438; &#x43D;&#x438;&#x445; &#x43E;&#x434;&#x438;&#x43D; &#x432;&#x44B;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x430;&#x43A; &#x43F;&#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x442;&#x430;&#x43A; &#x438; &#x43F;&#x43E; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x430;&#x43F;&#x433;&#x440;&#x435;&#x439;&#x434;&#x430;. &#x41A;&#x430;&#x440;&#x43C;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440; Philips Velo 1 &#x43D;&#x435; &#x438;&#x437;&#x431;&#x435;&#x436;&#x430;&#x43B; &#x43F;&#x440;&#x43E;&#x43A;&#x43B;&#x44F;&#x442;&#x438;&#x44F; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x446;&#x430;, &#x43A;&#x440;&#x430;&#x439;&#x43D;&#x435; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x43E; &#x443;&#x441;&#x442;&#x430;&#x440;&#x435;&#x43B;, &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43B;&#x43E;&#x43C;&#x430;&#x43B;&#x441;&#x44F; &#x438; &#x431;&#x44B;&#x43B; &#x437;&#x430;&#x441;&#x43B;&#x443;&#x436;&#x435;&#x43D;&#x43D;&#x43E; &#x437;&#x430;&#x431;&#x44B;&#x442;. &#x41F;&#x43E; &#x440;&#x44F;&#x434;&#x443; &#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D; &#x44F; &#x43A;&#x443;&#x43F;&#x438;&#x43B; &#x44D;&#x442;&#x43E;&#x442; &#x41A;&#x41F;&#x41A;, &#x438; &#x440;&#x435;&#x448;&#x438;&#x43B; &#x438;&#x441;&#x43F;&#x44B;&#x442;&#x430;&#x442;&#x44C; &#x43D;&#x430; &#x441;&#x435;&#x431;&#x435;, &#x43A;&#x430;&#x43A;&#x43E;&#x432;&#x430; &#x431;&#x44B;&#x43B;&#x430; &#x43C;&#x43E;&#x431;&#x438;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; Windows &#x434;&#x432;&#x430;&#x434;&#x446;&#x430;&#x442;&#x44C; &#x434;&#x432;&#x430; &#x433;&#x43E;&#x434;&#x430; &#x43D;&#x430;&#x437;&#x430;&#x434;. </div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/company/kaspersky/blog/455132/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455012"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article"><p>&#x41D;&#x430;&#x432;&#x435;&#x440;&#x43D;&#x43E;&#x435;, &#x434;&#x430;&#x436;&#x435; &#x434;&#x43E;&#x43C;&#x43E;&#x445;&#x43E;&#x437;&#x44F;&#x439;&#x43A;&#x438; &#x437;&#x43D;&#x430;&#x44E;&#x442;, &#x447;&#x442;&#x43E; &#x43F;&#x443;&#x431;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x442;&#x43E;&#x447;&#x43A;&#x438; Wi-Fi &#x43D;&#x435;&#x431;&#x435;&#x437;&#x43E;&#x43F;&#x430;&#x441;&#x43D;&#x44B;. &#x427;&#x442;&#x43E; &#x43D;&#x435; &#x43C;&#x435;&#x448;&#x430;&#x435;&#x442; &#x440;&#x44F;&#x434;&#x43E;&#x432;&#x44B;&#x43C; &#x44E;&#x437;&#x435;&#x440;&#x430;&#x43C; &#x432;&#x43E;&#x432;&#x441;&#x44E; &#x438;&#x43C;&#x438; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x2014; &#x432;&#x435;&#x434;&#x44C; &#x435;&#x441;&#x43B;&#x438; &#x43D;&#x435;&#x43B;&#x44C;&#x437;&#x44F;, &#x43D;&#x43E; &#x441;&#x43A;&#x443;&#x447;&#x43D;&#x43E; &#x438; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x445;&#x43E;&#x447;&#x435;&#x442;&#x441;&#x44F;, &#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E;! &#x418; &#x431;&#x435;&#x437; &#x432;&#x441;&#x44F;&#x43A;&#x43E;&#x433;&#x43E; VPN &#x2014; &#x445;&#x43E;&#x442;&#x44F; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; VPN &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x432;&#x43D;&#x435;&#x434;&#x440;&#x44F;&#x44E;&#x442; &#x434;&#x430;&#x436;&#x435; &#x432; &#x43A;&#x43E;&#x43C;&#x43F;&#x43B;&#x435;&#x43A;&#x441;&#x43D;&#x44B;&#x435; &#x430;&#x43D;&#x442;&#x438;&#x432;&#x438;&#x440;&#x443;&#x441;&#x43D;&#x44B;&#x435; &#x43F;&#x440;&#x43E;&#x434;&#x443;&#x43A;&#x442;&#x44B;. &#x417;&#x434;&#x43E;&#x440;&#x43E;&#x432;&#x43E;&#x439; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x43E;&#x439; Wi-Fi &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x441;&#x447;&#x438;&#x442;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x43E;&#x435; &#x43C;&#x43E;&#x431;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435;, &#x442;&#x435;&#x43C; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x447;&#x442;&#x43E; &#x441; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x43C; &#x433;&#x43E;&#x434;&#x43E;&#x43C; &#x43E;&#x43D;&#x43E; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x432;&#x441;&#x435; &#x434;&#x435;&#x448;&#x435;&#x432;&#x43B;&#x435;, &#x430; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x441;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x432;&#x441;&#x435; &#x432;&#x44B;&#x448;&#x435;. &#x41D;&#x43E; &#x442;&#x430;&#x43A; &#x43B;&#x438; &#x43E;&#x43D;&#x43E; &#x431;&#x435;&#x437;&#x43E;&#x43F;&#x430;&#x441;&#x43D;&#x43E;, &#x43A;&#x430;&#x43A; &#x43D;&#x430;&#x43C; &#x43A;&#x430;&#x436;&#x435;&#x442;&#x441;&#x44F;?</p><br> <p><a href="#a1">&#x2014; &#x427;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x435; IMSI-&#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x447;&#x438;&#x43A;?</a><br> <a href="#a2">&#x2014; &#x41A;&#x43E;&#x433;&#x434;&#x430; &#x43F;&#x43E;&#x44F;&#x432;&#x438;&#x43B;&#x438;&#x441;&#x44C; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x435; IMSI-&#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x447;&#x438;&#x43A;&#x438;?</a><br> <a href="#a3">&#x2014; &#x41A;&#x430;&#x43A; IMSI-&#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x447;&#x438;&#x43A;&#x438; &#x43C;&#x43E;&#x43D;&#x43E;&#x43F;&#x43E;&#x43B;&#x438;&#x437;&#x438;&#x440;&#x443;&#x44E;&#x442; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x43A; &#x43C;&#x43E;&#x431;&#x438;&#x43B;&#x44C;&#x43D;&#x438;&#x43A;&#x443;?</a><br> <a href="#a4">&#x2014; &#x411;&#x44B;&#x432;&#x430;&#x44E;&#x442; &#x43B;&#x438; &#x43A;&#x443;&#x441;&#x442;&#x430;&#x440;&#x43D;&#x44B;&#x435; &#x43F;&#x43E;&#x434;&#x435;&#x43B;&#x43A;&#x438;?</a><br> <a href="#a5">&#x2014; &#x41C;&#x43E;&#x433;&#x443; &#x43B;&#x438; &#x44F; &#x441;&#x442;&#x430;&#x442;&#x44C; &#x436;&#x435;&#x440;&#x442;&#x432;&#x43E;&#x439; &#xAB;&#x441;&#x43B;&#x443;&#x447;&#x430;&#x439;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x430;&#xBB;?</a><br> <a href="#a6">&#x2014; &#x41A;&#x430;&#x43A; IMSI-&#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x447;&#x438;&#x43A; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43E;&#x442;&#x441;&#x43B;&#x435;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43C;&#x43E;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x449;&#x435;&#x43D;&#x438;&#x44F;?</a><br> <a href="#a7">&#x2014; &#x41C;&#x43E;&#x433;&#x443;&#x442; &#x43B;&#x438; &#x43E;&#x43D;&#x438; &#x441;&#x43B;&#x443;&#x448;&#x430;&#x442;&#x44C; &#x43C;&#x43E;&#x438; &#x437;&#x432;&#x43E;&#x43D;&#x43A;&#x438;?</a><br> <a href="#a8">&#x2014; &#x41C;&#x43E;&#x433;&#x443;&#x442; &#x43B;&#x438; &#x43E;&#x43D;&#x438; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x430;&#x432;&#x43B;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x43D;&#x43E;&#x435; &#x43E;&#x431;&#x435;&#x441;&#x43F;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x43C;&#x43E;&#x451;&#x43C; &#x43C;&#x43E;&#x431;&#x438;&#x43B;&#x44C;&#x43D;&#x438;&#x43A;&#x435;?</a><br> <a href="#a9">&#x2014; &#x412;&#x441;&#x435; &#x43C;&#x44B; &#x437;&#x43D;&#x430;&#x435;&#x43C; &#x43E;&#x431; &#x43E;&#x43F;&#x430;&#x441;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x44B;&#x445; (&#x438; &#x43D;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E;) &#x442;&#x43E;&#x447;&#x435;&#x43A; Wi-Fi. &#x41C;&#x43E;&#x433;&#x443; &#x43B;&#x438; &#x44F; &#x441;&#x442;&#x430;&#x442;&#x44C; &#x436;&#x435;&#x440;&#x442;&#x432;&#x43E;&#x439; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x430;, &#x435;&#x441;&#x43B;&#x438; &#x431;&#x443;&#x434;&#x443; &#x432;&#x435;&#x437;&#x434;&#x435; &#x441;&#x438;&#x434;&#x435;&#x442;&#x44C; &#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437; LTE?</a><br> <a href="#a10">&#x2014; &#x410; &#x435;&#x441;&#x43B;&#x438; &#x44F; &#x2013; &#x43A;&#x440;&#x443;&#x442;&#x43E;&#x439; &#x431;&#x430;&#x43D;&#x43A;&#x438;&#x440; &#x438; &#x43C;&#x435;&#x43D;&#x44F; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x43E;&#x447;&#x435;&#x43D;&#x44C;-&#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x437;&#x430;&#x445;&#x43E;&#x442;&#x435;&#x442;&#x44C; &#x43F;&#x43E;&#x441;&#x43D;&#x438;&#x444;&#x430;&#x442;&#x44C;?</a><br> <a href="#a11">&#x2014; &#x41A;&#x430;&#x43A;&#x438;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x44F; &#x43C;&#x43E;&#x433;&#x443; &#x43F;&#x43E;&#x442;&#x435;&#x440;&#x44F;&#x442;&#x44C;, &#x435;&#x441;&#x43B;&#x438; &#x443;&#x447;&#x435;&#x441;&#x442;&#x44C; &#x442;&#x43E;&#x442; &#x444;&#x430;&#x43A;&#x442;, &#x447;&#x442;&#x43E; &#x443; &#x43C;&#x435;&#x43D;&#x44F; &#x432;&#x435;&#x437;&#x434;&#x435; HTTPS &#x438; &#x434;&#x432;&#x443;&#x445;&#x444;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x43D;&#x430;&#x44F; &#x430;&#x432;&#x442;&#x43E;&#x440;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F;?</a><br> <a href="#a12">&#x2014; &#x41A;&#x430;&#x43A; &#x437;&#x430;&#x449;&#x438;&#x449;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43E;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x430;?</a><br> <a href="#a13">&#x2014; &#x41C;&#x43E;&#x436;&#x435;&#x442; &#x43B;&#x438; ESD Overwatch &#x43E;&#x431;&#x435;&#x441;&#x43F;&#x435;&#x447;&#x438;&#x442;&#x44C; 100-&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x43D;&#x442;&#x43D;&#x443;&#x44E; &#x437;&#x430;&#x449;&#x438;&#x442;&#x443;?</a><br> <a href="#a14">&#x2014; &#x421;&#x43C;&#x43E;&#x433;&#x443;&#x442; &#x43B;&#x438; IMSI-&#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x447;&#x438;&#x43A;&#x438; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x43B;&#x443;&#x448;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43C;&#x435;&#x43D;&#x44F;, &#x435;&#x441;&#x43B;&#x438; &#x44F; &#x43F;&#x43E;&#x43C;&#x435;&#x43D;&#x44F;&#x44E; SIM-&#x43A;&#x430;&#x440;&#x442;&#x443;?</a><br> <a href="#a15">&#x2014; &#x410; &#x435;&#x441;&#x43B;&#x438; &#x44F; &#x43D;&#x430; CDMA, &#x44F; &#x431;&#x443;&#x434;&#x443; &#x432; &#x431;&#x435;&#x437;&#x43E;&#x43F;&#x430;&#x441;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x442; IMSI-&#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x447;&#x438;&#x43A;&#x430;?</a><br> <a href="#a16">&#x2014; &#x417;&#x430;&#x447;&#x435;&#x43C; &#x43F;&#x43B;&#x43E;&#x445;&#x438;&#x435; &#x43F;&#x430;&#x440;&#x43D;&#x438; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442;&#x441;&#x44F; IMSI-&#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C;&#x438;?</a><br> <a href="#a17">&#x2014; &#x41D;&#x430;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441;&#x435;&#x433;&#x43E;&#x434;&#x43D;&#x44F; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x44B; IMSI-&#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x447;&#x438;&#x43A;&#x438;?</a><br> <a href="#a18">&#x2014; &#x410; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x43D;&#x430;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x435;&#x440;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x430; &#x442;&#x435;&#x445;&#x43D;&#x438;&#x43A;&#x430; IMSI-&#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x430;? &#x41C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x435;&#x441;&#x442;&#x44C; &#x43A;&#x430;&#x43A;&#x438;&#x435;-&#x442;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x44B;?</a><br> <a href="#a19">&#x2014; &#x41A;&#x430;&#x43A; &#x43E;&#x442;&#x43D;&#x43E;&#x441;&#x44F;&#x442;&#x441;&#x44F; &#x43A; &#x43F;&#x438;&#x440;&#x430;&#x442;&#x430;&#x43C;-&#x43F;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C; &#x441;&#x43F;&#x435;&#x446;&#x441;&#x43B;&#x443;&#x436;&#x431;&#x44B;? &#x427;&#x442;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x435;&#x441;&#x43B;&#x438; &#x44F; &#x43F;&#x440;&#x43E;&#x439;&#x434;&#x443; &#x441; IMSI-&#x447;&#x435;&#x43C;&#x43E;&#x434;&#x430;&#x43D;&#x43E;&#x43C; &#x43C;&#x438;&#x43C;&#x43E; &#x41B;&#x443;&#x431;&#x44F;&#x43D;&#x43A;&#x438;?</a></p><br> <p><img src="https://habrastorage.org/webt/xg/fy/ew/xgfyewte03ivrcy-exkw_n8knak.jpeg"></p></div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/post/455012/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_454700"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article"><i><b>&#x41F;&#x440;&#x438;&#x43C;. &#x43F;&#x435;&#x440;&#x435;&#x432;.</b>: <a href="https://twitter.com/notdan">&#x410;&#x432;&#x442;&#x43E;&#x440;</a> &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x437;&#x430;&#x43C;&#x435;&#x442;&#x43A;&#x438;, &#x43E;&#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x439; 1 &#x438;&#x44E;&#x43D;&#x44F;, &#x440;&#x435;&#x448;&#x438;&#x43B; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x441;&#x442;&#x438; &#x44D;&#x43A;&#x441;&#x43F;&#x435;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x442; &#x432; &#x441;&#x440;&#x435;&#x434;&#x435; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x443;&#x44E;&#x449;&#x438;&#x445;&#x441;&#x44F; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x439; &#x431;&#x435;&#x437;&#x43E;&#x43F;&#x430;&#x441;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E;. &#x414;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43E;&#x43D; &#x43F;&#x43E;&#x434;&#x433;&#x43E;&#x442;&#x43E;&#x432;&#x438;&#x43B; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x44D;&#x43A;&#x441;&#x43F;&#x43B;&#x43E;&#x439;&#x442; &#x43A; &#x43D;&#x435;&#x440;&#x430;&#x441;&#x43A;&#x440;&#x44B;&#x442;&#x43E;&#x439; &#x443;&#x44F;&#x437;&#x432;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x432; &#x432;&#x435;&#x431;-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x435; &#x438; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43B; &#x435;&#x433;&#x43E; &#x432; &#x441;&#x432;&#x43E;&#x451;&#x43C; &#x442;&#x432;&#x438;&#x442;&#x442;&#x435;&#x440;&#x435;. &#x415;&#x433;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x2014; &#x431;&#x44B;&#x442;&#x44C; &#x43C;&#x433;&#x43D;&#x43E;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x440;&#x430;&#x437;&#x43E;&#x431;&#x43B;&#x430;&#x447;&#x451;&#x43D;&#x43D;&#x44B;&#x43C; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x438;&#x441;&#x442;&#x430;&#x43C;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x443;&#x432;&#x438;&#x434;&#x44F;&#x442; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x44B;&#x439; &#x43E;&#x431;&#x43C;&#x430;&#x43D; &#x432; &#x43A;&#x43E;&#x434;&#x435;, &#x2014; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x435; &#x43E;&#x43F;&#x440;&#x430;&#x432;&#x434;&#x430;&#x43B;&#x438;&#x441;&#x44C;&#x2026; &#x41E;&#x43D;&#x438; &#x43F;&#x440;&#x435;&#x432;&#x437;&#x43E;&#x448;&#x43B;&#x438; &#x432;&#x441;&#x435; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x43D;&#x438;&#x44F;, &#x43F;&#x440;&#x438;&#x447;&#x451;&#x43C; &#x432; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x43D;&#x443;&#x44E; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x443;: &#x442;&#x432;&#x438;&#x442; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B; &#x43E;&#x433;&#x440;&#x43E;&#x43C;&#x43D;&#x443;&#x44E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443; &#x43E;&#x442; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43B;&#x44E;&#x434;&#x435;&#x439;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x435; &#x441;&#x442;&#x430;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C;&#x43E;&#x435;.</i> <p> <img src="https://habrastorage.org/webt/d_/mf/x2/d_mfx2il6tobmejalx_mgzzltzc.jpeg"></p> <p> <b>TL;DR: &#x43D;&#x438; &#x432; &#x43A;&#x43E;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43D;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x439;&#x435;&#x440;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44E; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432; &#x432; sh &#x438;&#x43B;&#x438; bash. &#x42D;&#x442;&#x43E; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431; &#x443;&#x442;&#x440;&#x430;&#x442;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x44C; &#x43D;&#x430;&#x434; &#x43A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x43E;&#x43C;.</b></p></div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/company/flant/blog/454700/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item"> <div class="default-block"> <div class="default-block__content"> <ul class="megapost-teasers"> <li class="megapost-teasers__item teaser"> <a href="https://u.tmtm.ru/nukem_sale_promo" class="teaser__image"> <img src="https://habrastorage.org/getpro/tmtm/pictures/94e/5a1/9a4/94e5a19a4c9b183021600f92d2d9b4f5.png" class="teaser__image-pic"> </a> <a href="https://u.tmtm.ru/nukem_sale_promo" class="teaser__body"> </a> </li> <li class="megapost-teasers__item teaser"> <a href="https://u.tmtm.ru/ikraikra_courses_28922" class="teaser__image"> <img src="https://habrastorage.org/getpro/tmtm/pictures/f25/89f/2e5/f2589f2e56db98aa252efc6a148483f9.gif" class="teaser__image-pic"> </a> <a href="https://u.tmtm.ru/ikraikra_courses_28922" class="teaser__body"> </a> </li> <li class="megapost-teasers__item teaser"> <a href="https://u.tmtm.ru/oracle19c" class="teaser__image"> <img src="https://habrastorage.org/getpro/tmtm/pictures/18d/2dc/1f0/18d2dc1f00b6198145995417ef9f5f78.gif" class="teaser__image-pic"> </a> <a href="https://u.tmtm.ru/oracle19c" class="teaser__body"> </a> </li> </ul> </div> </div>
</li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455168"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article"><img src="https://habrastorage.org/webt/qj/3f/fm/qj3ffmnzhf4emk1bmyqyy-qrxsq.jpeg"> <p> &#x414;&#x435;&#x43C;&#x43A;&#x438; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x43E; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x439; &#x433;&#x440;&#x430;&#x444;&#x438;&#x43A;&#x43E;&#x439;, &#x447;&#x435;&#x43C; &#x438;&#x433;&#x440;&#x44B; &#x442;&#x43E;&#x433;&#x43E; &#x436;&#x435; &#x43E;&#x431;&#x44A;&#x451;&#x43C;&#x430;. &#x412;&#x435;&#x434;&#x44C; &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x442;&#x440;&#x430;&#x442;&#x438;&#x442;&#x44C; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x44B; &#x43D;&#x430; &#x432;&#x437;&#x430;&#x438;&#x43C;&#x43E;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; &#x441; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x43C; &#x438; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x440;&#x430;&#x441;&#x447;&#x451;&#x442;&#x44B;. &#x41F;&#x440;&#x435;&#x434;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x43C;&#x430;&#x44F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x43D;&#x430; &#x43C;&#x438;&#x43A;&#x440;&#x43E;&#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x43B;&#x435;&#x440;&#x435; ATtiny5 &#x441; 512 &#x431;&#x430;&#x439;&#x442;&#x430;&#x43C;&#x438; &#x41F;&#x417;&#x423;, 32 &#x431;&#x430;&#x439;&#x442;&#x430;&#x43C;&#x438; &#x41E;&#x417;&#x423; &#x438; 16 &#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x430;&#x43C;&#x438; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x430;. Rakettitiede &#x2014; &#x44D;&#x442;&#x43E; &#x43F;&#x43E;-&#x444;&#x438;&#x43D;&#x441;&#x43A;&#x438; &#xAB;&#x440;&#x430;&#x43A;&#x435;&#x442;&#x43D;&#x430;&#x44F; &#x43D;&#x430;&#x443;&#x43A;&#x430;&#xBB; (&#x432; &#x442;.&#x447;. &#x432; &#x442;&#x43E;&#x43C; &#x436;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x438;, &#x447;&#x442;&#x43E; &#x438; &#x432; &#x430;&#x43D;&#x433;&#x43B;&#x438;&#x439;&#x441;&#x43A;&#x43E;&#x43C; &#x444;&#x440;&#x430;&#x437;&#x435;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x437;&#x43C;&#x435;), &#x430; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x430;&#x43D;&#x438;&#x438;, &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x44E;&#x449;&#x435;&#x439; &#x41F;&#x41E;.</p></div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/post/455168/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455146"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article">&#x41F;&#x440;&#x438;&#x432;&#x435;&#x442;, &#x44F; &#x437;&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x44E;&#x441;&#x44C; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435;&#x43C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x434;&#x43B;&#x44F; &#x421;&#x423;&#x411;&#x414; <a href="http://tarantool.io/ru">Tarantool</a> &#x2014; &#x44D;&#x442;&#x43E; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43D;&#x43D;&#x430;&#x44F; &#x432; Mail.ru Group &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x430;, &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x449;&#x430;&#x44E;&#x449;&#x430;&#x44F; &#x432; &#x441;&#x435;&#x431;&#x435; &#x432;&#x44B;&#x441;&#x43E;&#x43A;&#x43E;&#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x421;&#x423;&#x411;&#x414; &#x438; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x43D;&#x430; &#x44F;&#x437;&#x44B;&#x43A;&#x435; Lua. &#x412;&#x44B;&#x441;&#x43E;&#x43A;&#x430;&#x44F; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x441;&#x442;&#x44C; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x439;, &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x43D;&#x430; Tarantool, &#x434;&#x43E;&#x441;&#x442;&#x438;&#x433;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x447;&#x430;&#x441;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x437;&#x430; &#x441;&#x447;&#x435;&#x442; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438; in-memory &#x440;&#x435;&#x436;&#x438;&#x43C;&#x430; &#x421;&#x423;&#x411;&#x414; &#x438; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x431;&#x438;&#x437;&#x43D;&#x435;&#x441;-&#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x438; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x435;&#x434;&#x438;&#x43D;&#x43E;&#x43C; &#x430;&#x434;&#x440;&#x435;&#x441;&#x43D;&#x43E;&#x43C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x441;&#x442;&#x432;&#x435; &#x441; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438;. &#x41F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x43E;&#x431;&#x435;&#x441;&#x43F;&#x435;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43D;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x441; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;&#x43C; ACID-&#x442;&#x440;&#x430;&#x43D;&#x437;&#x430;&#x43A;&#x446;&#x438;&#x439; (&#x43D;&#x430; &#x434;&#x438;&#x441;&#x43A;&#x435; &#x432;&#x435;&#x434;&#x435;&#x442;&#x441;&#x44F; WAL-&#x436;&#x443;&#x440;&#x43D;&#x430;&#x43B;). &#x412; Tarantool &#x438;&#x43C;&#x435;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;&#x43D;&#x430;&#x44F; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x430; &#x440;&#x435;&#x43F;&#x43B;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x438; &#x448;&#x430;&#x440;&#x434;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;. &#x41D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x44F; &#x441; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; 2.1, &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x44B; &#x43D;&#x430; &#x44F;&#x437;&#x44B;&#x43A;&#x435; SQL. Tarantool &#x438;&#x43C;&#x435;&#x435;&#x442; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x44B;&#x439; &#x438;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x434; &#x438; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x434; &#x43B;&#x438;&#x446;&#x435;&#x43D;&#x437;&#x438;&#x435;&#x439; Simplified BSD. &#x422;&#x430;&#x43A;&#x436;&#x435; &#x438;&#x43C;&#x435;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43A;&#x430;&#x44F; Enterprise-&#x432;&#x435;&#x440;&#x441;&#x438;&#x44F;. <p> <img src="https://habrastorage.org/getpro/habr/post_images/4aa/22f/d04/4aa22fd046775dd3b44af444ddcde28d.jpg"></p><br> <i>Feel the power! (...aka enjoy the performance)</i> &#x412;&#x441;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x435; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442; Tarantool &#x43F;&#x440;&#x438;&#x432;&#x43B;&#x435;&#x43A;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x43E;&#x439; &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x44B;&#x441;&#x43E;&#x43A;&#x43E;&#x43D;&#x430;&#x433;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;, &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x449;&#x438;&#x445; &#x441; &#x411;&#x414;. &#x412; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;&#x445; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x432;&#x43E;&#x437;&#x43D;&#x438;&#x43A;&#x430;&#x435;&#x442; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x44C; &#x440;&#x435;&#x43F;&#x43B;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;.</div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/company/mailru/blog/455146/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455178"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article">&#xAB;&#x41F;&#x43E;&#x439;&#x43C;&#x430;&#x439; &#x43C;&#x435;&#x43D;&#x44F;, &#x435;&#x441;&#x43B;&#x438; &#x441;&#x43C;&#x43E;&#x436;&#x435;&#x448;&#x44C;&#xBB;. &#x422;&#x430;&#x43A; &#x43D;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x444;&#x438;&#x43B;&#x44C;&#x43C; &#x421;&#x442;&#x438;&#x432;&#x435;&#x43D;&#x430; &#x421;&#x43F;&#x438;&#x43B;&#x431;&#x435;&#x440;&#x433;&#x430;. &#x42F; &#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x43B;, &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x43E;. &#x41D;&#x43E; &#x43D;&#x435; &#x43F;&#x440;&#x430;&#x432;&#x434;&#x430;, &#x445;&#x43E;&#x442;&#x44C; &#x438; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x43E; &#x43D;&#x430; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x44F;&#x445;. &#x412; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#xAB;&#x43F;&#x43E;&#x439;&#x43C;&#x430;&#x439; &#x43C;&#x435;&#x43D;&#x44F;, &#x435;&#x441;&#x43B;&#x438; &#x441;&#x43C;&#x43E;&#x436;&#x435;&#x448;&#x44C;&#xBB; &#x2014; &#x44D;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x430;&#x44F; &#x438;&#x433;&#x440;&#x430;. &#x42F; &#x432;&#x438;&#x436;&#x443; &#x44D;&#x442;&#x443; &#x438;&#x433;&#x440;&#x443; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x434;&#x435;&#x43D;&#x44C;, &#x438; &#x434;&#x430;&#x436;&#x435; &#x443;&#x447;&#x430;&#x441;&#x442;&#x432;&#x443;&#x44E; &#x432; &#x43D;&#x435;&#x439;. &#x418; &#x447;&#x443;&#x432;&#x441;&#x442;&#x432;&#x443;&#x44E; &#x441;&#x435;&#x431;&#x44F; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43D;&#x43E; &#x442;&#x430;&#x43A; &#x436;&#x435;, &#x43A;&#x430;&#x43A; &#x433;&#x435;&#x440;&#x43E;&#x439; &#x444;&#x438;&#x43B;&#x44C;&#x43C;&#x430; &#x421;&#x43F;&#x438;&#x43B;&#x431;&#x435;&#x440;&#x433;&#x430; &#x2013; &#x442;&#x43E;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x422;&#x43E;&#x43C; &#x425;&#x44D;&#x43D;&#x43A;&#x441; &#x438;&#x433;&#x440;&#x430;&#x435;&#x442;. &#x42F; &#x447;&#x443;&#x432;&#x441;&#x442;&#x432;&#x443;&#x44E; &#x441;&#x435;&#x431;&#x44F; &#x438;&#x434;&#x438;&#x43E;&#x442;&#x43E;&#x43C;. &#x411;&#x435;&#x441;&#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x43D;&#x44B;&#x43C; &#x438;&#x434;&#x438;&#x43E;&#x442;&#x43E;&#x43C;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x43C;&#x430;&#x43D;&#x44B;&#x432;&#x430;&#x44E;&#x442;, &#x433;&#x43B;&#x44F;&#x434;&#x44F; &#x432; &#x433;&#x43B;&#x430;&#x437;&#x430;, &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x434;&#x435;&#x43D;&#x44C;. &#x423; &#x43C;&#x435;&#x43D;&#x44F; &#x435;&#x441;&#x442;&#x44C; &#x432;&#x43B;&#x430;&#x441;&#x442;&#x44C;, &#x43D;&#x43E; &#x432;&#x441;&#x435;, &#x447;&#x442;&#x43E; &#x44F; &#x43C;&#x43E;&#x433;&#x443; &#x441; &#x435;&#x435; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x2013; &#x443;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x44C;. &#x425;&#x43E;&#x442;&#x44F;, &#x438; &#x44D;&#x442;&#x43E; &#x43D;&#x435; &#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x430;&#x435;&#x442; &#x2013; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x441;&#x43E;&#x442;&#x440;&#x443;&#x434;&#x43D;&#x438;&#x43A;, &#x438; &#x438;&#x433;&#x440;&#x430; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x43D;&#x43E;&#x432;&#x430;. <p> &#x421;&#x43B;&#x44B;&#x448;&#x430;&#x43B;&#x438;, &#x43D;&#x430;&#x432;&#x435;&#x440;&#x43D;&#x43E;&#x435;, &#x442;&#x430;&#x43A;&#x43E;&#x435; &#x43A;&#x440;&#x430;&#x441;&#x438;&#x432;&#x43E;&#x435; &#x432;&#x44B;&#x441;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x435;: &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x43F;&#x440;&#x438;&#x433;&#x43B;&#x430;&#x441;&#x438;&#x43B;&#x438; &#x43D;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x443; &#x43A;&#x432;&#x430;&#x43B;&#x438;&#x444;&#x438;&#x446;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x438;&#x441;&#x442;&#x430;, &#x442;&#x43E; &#x43D;&#x430;&#x434;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43E;&#x43D; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x442;, &#x430; &#x43D;&#x435; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x44C; &#x435;&#x43C;&#x443;, &#x447;&#x442;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C;. &#x410; &#x432;&#x44B; &#x43F;&#x440;&#x43E;&#x431;&#x43E;&#x432;&#x430;&#x43B;&#x438; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x44F;&#x442; &#x44D;&#x442;&#x438; &#x43A;&#x432;&#x430;&#x43B;&#x438;&#x444;&#x438;&#x446;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x438;&#x441;&#x442;&#x44B;? &#x42F; &#x43F;&#x440;&#x43E;&#x431;&#x43E;&#x432;&#x430;&#x43B;. &#x418; &#x441;&#x43A;&#x430;&#x436;&#x443; &#x43F;&#x440;&#x44F;&#x43C;&#x43E;: &#x44D;&#x442;&#x43E; &#x43F;&#x43E;&#x43B;&#x43D;&#x430;&#x44F; &#x447;&#x443;&#x448;&#x44C;.</p></div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/post/455178/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_409571"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article">&#x418;&#x43D;&#x43E;&#x43F;&#x43B;&#x430;&#x43D;&#x435;&#x442;&#x44F;&#x43D;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x436;&#x435; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x44B;&#x43C; &#x441;&#x442;&#x43E;&#x43B;&#x43F;&#x43E;&#x43C; &#x43D;&#x430;&#x443;&#x447;&#x43D;&#x43E;&#x439; &#x444;&#x430;&#x43D;&#x442;&#x430;&#x441;&#x442;&#x438;&#x43A;&#x438;, &#x43A;&#x430;&#x43A; &#x438; <a href="https://habr.com/post/362209/">&#x43C;&#x435;&#x436;&#x437;&#x432;&#x451;&#x437;&#x434;&#x43D;&#x44B;&#x435; &#x43F;&#x43E;&#x43B;&#x451;&#x442;&#x44B;</a>. &#x415;&#x441;&#x43B;&#x438; &#x437;&#x430;&#x434;&#x443;&#x43C;&#x430;&#x442;&#x44C;&#x441;&#x44F;, &#x442;&#x43E; &#x43F;&#x43E;&#x436;&#x430;&#x43B;&#x443;&#x439; &#x434;&#x430;&#x436;&#x435; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x432;&#x43B;&#x438;&#x44F;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x2014; &#x418;&#x434;&#x435;&#x438; &#x43E; &#x447;&#x443;&#x436;&#x434;&#x43E;&#x439; &#x436;&#x438;&#x437;&#x43D;&#x438; &#x43E;&#x431;&#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x432; &#x444;&#x430;&#x43D;&#x442;&#x430;&#x441;&#x442;&#x438;&#x43A;&#x435; &#x434;&#x430;&#x436;&#x435; <i>&#x434;&#x43E; </i>&#x43C;&#x435;&#x436;&#x437;&#x432;&#x451;&#x437;&#x434;&#x43D;&#x44B;&#x445; &#x43F;&#x43E;&#x43B;&#x435;&#x442;&#x43E;&#x432;, &#x441; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43C;&#x438; &#x413;&#x435;&#x440;&#x431;&#x435;&#x440;&#x442;&#x430; &#x423;&#x44D;&#x43B;&#x43B;&#x441;&#x430; &#x438; &#x42D;&#x434;&#x433;&#x430;&#x440;&#x430; &#x411;&#x435;&#x440;&#x440;&#x43E;&#x443;&#x437;&#x430;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x432; &#x43B;&#x438;&#x442;&#x435;&#x440;&#x430;&#x442;&#x443;&#x440;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x442; &#x435;&#x449;&#x451; &#x431;&#x443;&#x434;&#x43E;&#x440;&#x430;&#x436;&#x438;&#x442; &#x432;&#x43E;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43B;&#x44E;&#x434;&#x435;&#x439; &#x438; &#x43F;&#x43E;&#x440;&#x43E;&#x439; &#x43F;&#x43E;&#x440;&#x43E;&#x436;&#x434;&#x430;&#x435;&#x442; &#x43A;&#x440;&#x430;&#x439;&#x43D;&#x435; &#x43D;&#x435;&#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x442;&#x44B;, &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x431;&#x443;&#x43C;&#x430;&#x433;&#x430; &#x441;&#x442;&#x435;&#x440;&#x43F;&#x438;&#x442; &#x432;&#x441;&#x451;, &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44F;&#x445; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43E;&#x43F;&#x438;&#x440;&#x430;&#x44E;&#x449;&#x438;&#x445;&#x441;&#x44F; &#x43D;&#x430; &#x432;&#x438;&#x437;&#x443;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x441;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x449;&#x443;&#x44E;, &#x442;&#x430;&#x43A;&#x438;&#x445; &#x43A;&#x430;&#x43A; &#x43A;&#x438;&#x43D;&#x43E; &#x438; &#x438;&#x433;&#x440;&#x44B;, &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x438; &#x43D;&#x435;&#x43F;&#x440;&#x438;&#x43B;&#x438;&#x447;&#x43D;&#x43E; &#x43F;&#x435;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x430;. <div><img src="https://habrastorage.org/getpro/habr/post_images/980/d20/e18/980d20e18a62379aa90bfebc09d43458.png" alt="image"></div> <p> &#x412; 9 &#x438;&#x437; 10 &#x442;&#x430;&#x43A;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x439; &#xAB;&#x438;&#x43D;&#x43E;&#x43F;&#x43B;&#x430;&#x43D;&#x435;&#x442;&#x44F;&#x43D;&#x438;&#x43D;&#xBB; &#x43F;&#x43E; &#x437;&#x430;&#x43C;&#x44B;&#x441;&#x43B;&#x443; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439; &#x2014; &#x44D;&#x442;&#x43E; &#x442;&#x438;&#x43F;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x447;&#x435;&#x43B;&#x43E;&#x432;&#x435;&#x43A;, &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441;&#x43E; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x432;&#x44B;&#x440;&#x43E;&#x441;&#x442;&#x430;&#x43C;&#x438; &#x43D;&#x430; &#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x435;, &#x438;\&#x438;&#x43B;&#x438; &#x43D;&#x435;&#x435;&#x441;&#x442;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x446;&#x432;&#x435;&#x442;&#x43E;&#x43C; &#x43A;&#x43E;&#x436;&#x438; (&#x41D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x445;&#x440;&#x435;&#x441;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x439;&#x43D;&#x44B;&#x439; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x431;&#x435;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x438;&#x44F; &#x2014; &#x441;&#x435;&#x440;&#x438;&#x430;&#x43B; Star Trek). &#x412; &#x445;&#x443;&#x434;&#x448;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x437;&#x430;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43B;&#x435;&#x43D;&#x438; &#x438;&#x43D;&#x43E;&#x43F;&#x43B;&#x430;&#x43D;&#x435;&#x442;&#x44F;&#x43D;&#x438;&#x43D; &#x431;&#x443;&#x434;&#x435;&#x442; <i>&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; </i>&#x447;&#x435;&#x43B;&#x43E;&#x432;&#x435;&#x43A;&#x43E;&#x43C;, &#x431;&#x435;&#x437; &#x43A;&#x430;&#x43A;&#x438;&#x445;-&#x43B;&#x438;&#x431;&#x43E; &#x432;&#x43D;&#x435;&#x448;&#x43D;&#x438;&#x445; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x438;&#x439; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435;. &#x42D;&#x442;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x438;&#x43D;&#x43E;&#x43F;&#x43B;&#x430;&#x43D;&#x435;&#x442;&#x44F;&#x43D;&#x438;&#x43D; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x430;&#x43A; &#x43F;&#x435;&#x440;&#x441;&#x43E;&#x43D;&#x430;&#x436; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x43E;&#x447;&#x443;&#x432;&#x441;&#x442;&#x432;&#x43E;&#x432;&#x430;&#x442;&#x44C;, &#x432; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x435;&#x441;&#x43B;&#x438; &#x44D;&#x442;&#x43E;&#x442; &#x438;&#x43D;&#x43E;&#x43F;&#x43B;&#x430;&#x43D;&#x435;&#x442;&#x44F;&#x43D;&#x438;&#x43D; &#x437;&#x430;&#x434;&#x443;&#x43C;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x430;&#x43A; &#x432;&#x440;&#x430;&#x433;, &#x442;&#x43E; &#x435;&#x433;&#x43E; &#x432;&#x43D;&#x435;&#x448;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x438; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43D;&#x430;&#x43F;&#x43E;&#x43C;&#x438;&#x43D;&#x430;&#x44E;&#x442; &#x43A;&#x430;&#x43A;&#x43E;&#x435;-&#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C; &#x440;&#x430;&#x437;&#x44A;&#x44F;&#x440;&#x435;&#x43D;&#x43D;&#x43E;&#x435; &#x434;&#x438;&#x43A;&#x43E;&#x435; &#x436;&#x438;&#x432;&#x43E;&#x442;&#x43D;&#x43E;&#x435;, &#x447;&#x435;&#x43C; &#x440;&#x430;&#x437;&#x443;&#x43C;&#x43D;&#x43E;&#x435; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E;. &#x420;&#x44B;&#x447;&#x430;&#x43D;&#x438;&#x435; &#x438;&#x43B;&#x438; &#x431;&#x440;&#x438;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;-&#x43E;&#x441;&#x442;&#x440;&#x44B;&#x435; &#x43A;&#x43E;&#x433;&#x442;&#x438; &#x432; &#x43F;&#x43E;&#x43B;&#x43C;&#x435;&#x442;&#x440;&#x430; &#x434;&#x43B;&#x438;&#x43D;&#x43E;&#x439; &#x43D;&#x435; &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;, &#x43D;&#x43E; &#x43A;&#x440;&#x430;&#x439;&#x43D;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x442;&#x441;&#x44F;.</p> &#x413;&#x434;&#x435;-&#x442;&#x43E; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43D;&#x43E; &#x434;&#x43E; &#x441;&#x435;&#x440;&#x435;&#x434;&#x438;&#x43D;&#x44B; &#x438;&#x43B;&#x438; &#x43A;&#x43E;&#x43D;&#x446;&#x430; 90&#x445; &#x442;&#x430;&#x43A;&#x430;&#x44F; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x44F; &#x438;&#x43C;&#x435;&#x43B;&#x430; &#x432;&#x435;&#x441;&#x44C;&#x43C;&#x430; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x43E;&#x435; &#x43E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x435;&#x43D;&#x438;&#x435;: &#x427;&#x442;&#x43E;&#x431;&#x44B; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x441;&#x43E;&#x43D;&#x430;&#x436;&#x430;, &#x43D;&#x435; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x435;&#x433;&#x43E; &#x43D;&#x430; &#x447;&#x435;&#x43B;&#x43E;&#x432;&#x435;&#x43A;&#x430;, &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x43E;&#x439; &#x431;&#x44E;&#x434;&#x436;&#x435;&#x442; &#x438; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x435;&#x43D;&#x435;&#x433; &#x43D;&#x430; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435; &#x430;&#x43D;&#x438;&#x43C;&#x430;&#x442;&#x440;&#x43E;&#x43D;&#x43D;&#x44B;&#x445; &#x43A;&#x443;&#x43A;&#x43E;&#x43B; (&#x410; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x432;&#x441;&#x451; &#x440;&#x430;&#x432;&#x43D;&#x43E; &#x43C;&#x43E;&#x433; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435;&#x443;&#x434;&#x43E;&#x432;&#x43B;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x435;&#x43B;&#x435;&#x43D; &#x43F;&#x43E; &#x443;&#x431;&#x435;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;). &#x414;&#x430;&#x43B;&#x435;&#x43A;&#x43E; &#x43D;&#x435; &#x432;&#x441;&#x435; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x44B; &#x43E;&#x431;&#x43B;&#x430;&#x434;&#x430;&#x43B;&#x438; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E;&#x43C; &#x434;&#x435;&#x43D;&#x435;&#x433; &#x438; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438;, &#x442;&#x435;&#x43C; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x442;&#x435;&#x43B;&#x435;&#x432;&#x438;&#x437;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x435; &#x441;&#x435;&#x440;&#x438;&#x430;&#x43B;&#x44B;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x437;&#x430;&#x433;&#x440;&#x438;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x430;&#x43A;&#x442;&#x435;&#x440; &#x43E;&#x441;&#x442;&#x430;&#x432;&#x430;&#x43B;&#x441;&#x44F; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x434;&#x435;&#x448;&#x435;&#x432;&#x44B;&#x43C;, &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x43D;&#x44B;&#x43C; &#x438; &#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x441;&#x44B;&#x43C;&#x438;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438;&#x43D;&#x43E;&#x43F;&#x43B;&#x430;&#x43D;&#x435;&#x442;&#x44F;&#x43D;&#x438;&#x43D;&#x430;.</div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/post/409571/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item"> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455144"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article">&#x410;&#x432;&#x442;&#x43E;&#x440; &#x43C;&#x430;&#x442;&#x435;&#x440;&#x438;&#x430;&#x43B;&#x430;, &#x43F;&#x435;&#x440;&#x435;&#x432;&#x43E;&#x434; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x43C;&#x44B; &#x441;&#x435;&#x433;&#x43E;&#x434;&#x43D;&#x44F; &#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x443;&#x435;&#x43C;, &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x442;, &#x447;&#x442;&#x43E; &#x445;&#x43E;&#x447;&#x435;&#x442; &#x43F;&#x43E;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x441; &#x447;&#x438;&#x442;&#x430;&#x442;&#x435;&#x43B;&#x44F;&#x43C;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x43D;&#x43E;&#x437;&#x43E;&#x43C;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43A;&#x430;&#x441;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x440;&#x430;&#x437;&#x432;&#x438;&#x442;&#x438;&#x44F; &#x432;&#x435;&#x431;-&#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x439; &#x43D;&#x430; &#x431;&#x43B;&#x438;&#x436;&#x430;&#x439;&#x448;&#x438;&#x435; &#x433;&#x43E;&#x434;&#x44B;. &#x412; &#x447;&#x430;&#x441;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x437;&#x434;&#x435;&#x441;&#x44C; &#x440;&#x435;&#x447;&#x44C; &#x43F;&#x43E;&#x439;&#x434;&#x451;&#x442; &#x43E; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E;, &#x43F;&#x43E; &#x43C;&#x43D;&#x435;&#x43D;&#x438;&#x44E; &#x430;&#x432;&#x442;&#x43E;&#x440;&#x430;, &#x444;&#x440;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x434;-&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C;, &#x432;&#x435;&#x440;&#x43E;&#x44F;&#x442;&#x43D;&#x43E;, &#x441;&#x442;&#x43E;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x447;&#x430;&#x442;&#x44C; &#x438;&#x437;&#x443;&#x447;&#x430;&#x442;&#x44C; &#x443;&#x436;&#x435; &#x441;&#x435;&#x433;&#x43E;&#x434;&#x43D;&#x44F;. &#x412;&#x441;&#x451;, &#x447;&#x442;&#x43E; &#x441;&#x432;&#x44F;&#x437;&#x430;&#x43D;&#x43E; &#x441; JavaScript, &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x43E; &#x440;&#x430;&#x437;&#x432;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F;. &#x42D;&#x442;&#x43E; &#x43A;&#x430;&#x441;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x438; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43E;&#x442;&#x43D;&#x435;&#x441;&#x442;&#x438; &#x43A; &#x441;&#x444;&#x435;&#x440;&#x435; &#x432;&#x435;&#x431;-&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;. &#x412; &#x43D;&#x430;&#x448;&#x438; &#x434;&#x43D;&#x438; &#x442;&#x435;, &#x432; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x435; &#x447;&#x44C;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x43E;&#x432; &#x43D;&#x435; &#x43B;&#x435;&#x436;&#x430;&#x442; &#x441;&#x430;&#x43C;&#x44B;&#x435; &#x441;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x438;, &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x442; &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x43E;&#x449;&#x443;&#x449;&#x430;&#x442;&#x44C; &#x440;&#x430;&#x437;&#x440;&#x44B;&#x432; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x442;&#x435;&#x43C;, &#x447;&#x435;&#x43C; &#x43E;&#x43D;&#x438; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442;&#x441;&#x44F;, &#x438; &#x442;&#x435;&#x43C; &#x43D;&#x43E;&#x432;&#x44B;&#x43C;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x435;&#x434;&#x432;&#x430; &#x43B;&#x438; &#x43D;&#x435; &#x435;&#x436;&#x435;&#x434;&#x43D;&#x435;&#x432;&#x43D;&#x43E;. &#x41A; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x44F;&#x43C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43E;&#x442;&#x43D;&#x435;&#x441;&#x442;&#x438; Webpack, React, Jest, Vue, Angular &#x432; &#x438;&#x445; &#x441;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x43C; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x438;. &#x412; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; &#xAB;&#x43D;&#x430;&#x441;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x435;&#xBB; &#x43C;&#x438;&#x440;&#x430; &#x444;&#x440;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x434;-&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x449;&#x435;&#x435; &#x432; &#x441;&#x435;&#x431;&#x44F; &#x442;&#x435;&#x445;&#x43D;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x445; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x438;&#x441;&#x442;&#x43E;&#x432; &#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x441;&#x442;&#x43E;&#x432;, &#x43F;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x43D;&#x43E; &#x440;&#x430;&#x441;&#x442;&#x451;&#x442;, &#x44D;&#x442;&#x43E;&#x442; &#x43C;&#x438;&#x440; &#x441;&#x442;&#x440;&#x435;&#x43C;&#x438;&#x442;&#x441;&#x44F; &#x43A; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;. &#x41F;&#x43E;&#x44F;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x43E;&#x432;&#x44B;&#x445; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x439; &#x438; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x443;&#x436;&#x435; &#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x44E;. <p> <a href="https://habr.com/ru/company/ruvds/blog/455144/"><img src="https://habrastorage.org/webt/cz/x5/lq/czx5lqprmamteje5t3oc8suctn0.png"></a></p> &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x441; &#x438;&#x437;&#x440;&#x44F;&#x434;&#x43D;&#x43E;&#x439; &#x434;&#x43E;&#x43B;&#x435;&#x439; &#x443;&#x432;&#x435;&#x440;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x442;&#x44C; &#x43E; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x43E;&#x431;&#x449;&#x438;&#x43C; &#x442;&#x440;&#x435;&#x43D;&#x434;&#x43E;&#x43C; &#x440;&#x430;&#x437;&#x432;&#x438;&#x442;&#x438;&#x44F; &#x444;&#x440;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x434;-&#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x439; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x445; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x43E;&#x432;. &#x412; &#x447;&#x430;&#x441;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x440;&#x435;&#x447;&#x44C; &#x438;&#x434;&#x451;&#x442; &#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x437;&#x438;&#x446;&#x438;&#x438;, &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x43D;&#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x445;, &#x43E; &#x441;&#x442;&#x440;&#x435;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x438; &#x43A; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;. &#x42D;&#x442;&#x430; &#x442;&#x435;&#x43D;&#x434;&#x435;&#x43D;&#x446;&#x438;&#x44F; &#x432;&#x43E;&#x437;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43D;&#x430; &#x432;&#x441;&#x451; &#x2014; &#x43E;&#x442; &#x441;&#x442;&#x438;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x434;&#x43E; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x438; &#x434;&#x430;&#x436;&#x435; &#x434;&#x43E; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435;&#x43C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;. &#x412; &#x44D;&#x442;&#x43E;&#x442; &#x442;&#x440;&#x435;&#x43D;&#x434; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x44C; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x438;, &#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x432;&#x43E;&#x43A;&#x440;&#x443;&#x433; &#x432;&#x435;&#x431;-&#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;, ES-&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439;, &#x441;&#x44E;&#x434;&#x430; &#x436;&#x435; &#x43F;&#x43E;&#x43F;&#x430;&#x434;&#x430;&#x44E;&#x442; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x438; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x435; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x435;.</div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/company/ruvds/blog/455144/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_454968"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article"><img src="https://habrastorage.org/webt/hz/ih/2n/hzih2nqzqypj84phtojxde3bzqa.jpeg"> &#x41A;&#x43E;&#x433;&#x434;&#x430; 1974 &#x433;&#x43E;&#x434;&#x443; &#x432; &#x41B;&#x435;&#x43D;&#x438;&#x43D;&#x433;&#x440;&#x430;&#x434;&#x435; &#x431;&#x44B;&#x43B; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D; &#x43D;&#x430;&#x443;&#x447;&#x43D;&#x43E;-&#x438;&#x441;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x439; &#x432;&#x44B;&#x447;&#x438;&#x441;&#x43B;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x446;&#x435;&#x43D;&#x442;&#x440; (&#x43D;&#x44B;&#x43D;&#x435; &#x2014; &#x421;&#x41F;&#x418;&#x418;&#x420;&#x410;&#x41D;: &#x421;&#x430;&#x43D;&#x43A;&#x442;-&#x41F;&#x435;&#x442;&#x435;&#x440;&#x431;&#x443;&#x440;&#x433;&#x441;&#x43A;&#x438;&#x439; &#x438;&#x43D;&#x441;&#x442;&#x438;&#x442;&#x443;&#x442; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x438;&#x43A;&#x438; &#x438; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x420;&#x43E;&#x441;&#x441;&#x438;&#x439;&#x441;&#x43A;&#x43E;&#x439; &#x430;&#x43A;&#x430;&#x434;&#x435;&#x43C;&#x438;&#x438; &#x43D;&#x430;&#x443;&#x43A;), &#x432; &#x433;&#x440;&#x443;&#x43F;&#x43F;&#x443; &#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x435;&#x441;&#x43F;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x42D;&#x412;&#x41C; &#x432;&#x43E;&#x448;&#x435;&#x43B; &#x412;&#x43B;&#x430;&#x434;&#x438;&#x43C;&#x438;&#x440; &#x412;&#x43E;&#x440;&#x43E;&#x431;&#x44C;&#x435;&#x432;. &#x412; 1978 &#x433;&#x43E;&#x434;&#x443; &#x43D;&#x430; &#x435;&#x435; &#x431;&#x430;&#x437;&#x435; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x430;&#x43B;&#x430;&#x441;&#x44C; &#x43E;&#x434;&#x43D;&#x43E;&#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x430;&#x44F; &#x43B;&#x430;&#x431;&#x43E;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;&#x44F;, &#x438; &#x412;&#x43B;&#x430;&#x434;&#x438;&#x43C;&#x438;&#x440; &#x418;&#x432;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x447; &#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x43B; &#x435;&#x439; &#x432; &#x442;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x435; 30 &#x43B;&#x435;&#x442;. &#x412;&#x43E;&#x440;&#x43E;&#x431;&#x44C;&#x435;&#x432; &#x2014; &#x434;&#x43E;&#x43A;&#x442;&#x43E;&#x440; &#x444;&#x438;&#x437;&#x438;&#x43A;&#x43E;-&#x43C;&#x430;&#x442;&#x435;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x445; &#x43D;&#x430;&#x443;&#x43A;, &#x43F;&#x440;&#x43E;&#x444;&#x435;&#x441;&#x441;&#x43E;&#x440;. &#x421;&#x435;&#x439;&#x447;&#x430;&#x441; &#x43E;&#x43D; &#x437;&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x442; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x433;&#x43B;&#x430;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43D;&#x430;&#x443;&#x447;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x43E;&#x442;&#x440;&#x443;&#x434;&#x43D;&#x438;&#x43A;&#x430;, &#x430; &#x43C;&#x435;&#x441;&#x442;&#x43E; &#x435;&#x433;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x43D;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#xAB;&#x41B;&#x430;&#x431;&#x43E;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x438;&#x44F; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;-&#x432;&#x44B;&#x447;&#x438;&#x441;&#x43B;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C; &#x438; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x439; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;&#xBB;. <p> <i>&#x41C;&#x44B; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x430;&#x435;&#x43C; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x442;&#x44C; &#x43C;&#x443;&#x437;&#x435;&#x439;&#x43D;&#x443;&#x44E; &#x43A;&#x43E;&#x43B;&#x43B;&#x435;&#x43A;&#x446;&#x438;&#x44E; DataArt &#x438;&#x43D;&#x442;&#x435;&#x440;&#x432;&#x44C;&#x44E; &#x43E;&#x431; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x438; &#x418;&#x422;. &#x420;&#x430;&#x43D;&#x435;&#x435; &#x43D;&#x430;&#x448;&#x438;&#x43C;&#x438; &#x441;&#x43E;&#x431;&#x435;&#x441;&#x435;&#x434;&#x43D;&#x438;&#x43A;&#x430;&#x43C;&#x438; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x43B;&#x438;&#x441;&#x44C; <a href="https://habr.com/ru/company/dataart/blog/447508/">&#x421;&#x435;&#x440;&#x433;&#x435;&#x439; &#x417;&#x43E;&#x43D;&#x43E;&#x432;</a>, <a href="https://habr.com/ru/company/dataart/blog/450198/">&#x415;&#x432;&#x433;&#x435;&#x43D;&#x438;&#x439; &#x41A;&#x430;&#x43D;&#x435;&#x432;&#x441;&#x43A;&#x438;&#x439;</a> &#x438; <a href="https://habr.com/ru/company/dataart/blog/451934/">&#x410;&#x43B;&#x435;&#x43A;&#x441;&#x430;&#x43D;&#x434;&#x440; &#x41B;&#x430;&#x43C;&#x434;&#x435;&#x43D;</a>.</i></p></div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/company/dataart/blog/454968/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455230"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article"><p><img src="https://habrastorage.org/getpro/habr/post_images/523/17b/496/52317b4960a8b063bc7b6541e4e2666d.png" alt="Picture 9"></p> &#x41D;&#x435; &#x441;&#x435;&#x43A;&#x440;&#x435;&#x442;, &#x447;&#x442;&#x43E; Microsoft &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x434;&#x430;&#x432;&#x43D;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x43D;&#x430;&#x434; &#x432;&#x44B;&#x43F;&#x443;&#x441;&#x43A;&#x43E;&#x43C; &#x432;&#x43E;&#x441;&#x44C;&#x43C;&#x43E;&#x439; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; C#. &#x412; &#x43D;&#x435;&#x434;&#x430;&#x432;&#x43D;&#x43E; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x432;&#x448;&#x435;&#x43C;&#x441;&#x44F; &#x440;&#x435;&#x43B;&#x438;&#x437;&#x435; Visual Studio 2019 &#x43D;&#x43E;&#x432;&#x430;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x44F;&#x437;&#x44B;&#x43A;&#x430; (C# 8.0) &#x443;&#x436;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x430;, &#x43D;&#x43E; &#x43F;&#x43E;&#x43A;&#x430; &#x435;&#x449;&#x451; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; beta &#x440;&#x435;&#x43B;&#x438;&#x437;&#x430;. &#x412; &#x43F;&#x43B;&#x430;&#x43D;&#x430;&#x445; &#x44D;&#x442;&#x43E;&#x439; &#x43D;&#x43E;&#x432;&#x43E;&#x439; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x435;&#x441;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439;, &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x435; &#x441;&#x43E;&#x432;&#x441;&#x435;&#x43C; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x43E;&#x439;, &#x438;&#x43B;&#x438; &#x442;&#x43E;&#x447;&#x43D;&#x435;&#x435;, &#x43D;&#x435; &#x441;&#x43E;&#x432;&#x441;&#x435;&#x43C; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x435;&#x43C;&#x43E;&#x439;. &#x41E;&#x434;&#x43D;&#x438;&#x43C; &#x438;&#x437; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x439; &#x441;&#x442;&#x430;&#x43B;&#x430; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; Nullable Reference &#x442;&#x438;&#x43F;&#x43E;&#x432;. &#x417;&#x430;&#x44F;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x441;&#x43C;&#x44B;&#x441;&#x43B;&#x43E;&#x43C; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43D;&#x43E;&#x432;&#x43E;&#x432;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x431;&#x43E;&#x440;&#x44C;&#x431;&#x430; &#x441; Null Reference Exception&apos;&#x430;&#x43C;&#x438; (NRE).</div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/company/pvs-studio/blog/455230/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455194"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article"><img src="https://habrastorage.org/webt/v3/rr/bf/v3rrbfaweynyzedhxjaofue9xgm.jpeg"> <p>&#x412;&#x447;&#x435;&#x440;&#x430; Amazon <a href="https://blog.aboutamazon.com/transportation/a-drone-program-taking-flight">&#x432;&#x43F;&#x435;&#x440;&#x432;&#x44B;&#x435;</a> &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x438;&#x43B;&#x430; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x434;&#x440;&#x43E;&#x43D; &#x434;&#x43B;&#x44F; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43A;&#x438; &#x2013; &#x43D;&#x430; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x439; &#x43A;&#x43E;&#x43D;&#x444;&#x435;&#x440;&#x435;&#x43D;&#x446;&#x438;&#x438; Re:Mars &#x432; &#x41B;&#x430;&#x441;-&#x412;&#x435;&#x433;&#x430;&#x441;&#x435;. &#x42D;&#x442;&#x43E; &#x43D;&#x430; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x434;&#x435;&#x43B;&#x435; &#x443;&#x43D;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x43E;, &#x434;&#x43E;&#x432;&#x435;&#x440;&#x445;&#x443; &#x43D;&#x430;&#x43F;&#x438;&#x447;&#x43A;&#x430;&#x43D;&#x43D;&#x43E;&#x435; &#x441;&#x435;&#x43D;&#x441;&#x43E;&#x440;&#x430;&#x43C;&#x438; &#x438; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x430;&#x43C;&#x438;. &#x41A; &#x442;&#x43E;&#x43C;&#x443; &#x436;&#x435;, &#x44D;&#x442;&#x43E; &#x434;&#x440;&#x43E;&#x43D;-&#x442;&#x440;&#x430;&#x43D;&#x441;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x440;. &#x41E;&#x43D; &#x443;&#x43C;&#x435;&#x435;&#x442; &#x43B;&#x435;&#x442;&#x435;&#x442;&#x44C; &#x432;&#x435;&#x440;&#x442;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;, &#x43A;&#x430;&#x43A; &#x432;&#x435;&#x440;&#x442;&#x43E;&#x43B;&#x435;&#x442;, &#x432;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43F;&#x43E;&#x434;&#x44A;&#x435;&#x43C;&#x430; &#x438; &#x43F;&#x440;&#x438;&#x437;&#x435;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x44F;, &#x438; &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x430;&#x44D;&#x440;&#x43E;&#x434;&#x438;&#x43D;&#x430;&#x43C;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#xAB;&#x440;&#x435;&#x436;&#x438;&#x43C; &#x441;&#x430;&#x43C;&#x43E;&#x43B;&#x435;&#x442;&#x430;&#xBB;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43D;&#x443;&#x436;&#x43D;&#x430; &#x441;&#x43A;&#x43E;&#x440;&#x43E;&#x441;&#x442;&#x44C;. &#x418; &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x438;&#x442;, &#x438; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x434;&#x435;&#x432;&#x430;&#x439;&#x441; &#x43A;&#x430;&#x43A; &#x43A;&#x430;&#x43A;&#x430;&#x44F;-&#x442;&#x43E; &#x43C;&#x430;&#x448;&#x438;&#x43D;&#x430; &#x438;&#x437; &#x434;&#x430;&#x43B;&#x435;&#x43A;&#x43E;&#x433;&#x43E; &#x431;&#x443;&#x434;&#x443;&#x449;&#x435;&#x433;&#x43E;.</p></div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/company/pochtoy/blog/455194/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item"> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455212"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article">&#x412;&#x435;&#x431;-&#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43D;&#x44B;&#x43D;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x432;&#x441;&#x435;&#x43C;&#x435;&#x441;&#x442;&#x43D;&#x43E;, &#x430; &#x441;&#x440;&#x435;&#x434;&#x438; &#x432;&#x441;&#x435;&#x445; &#x442;&#x440;&#x430;&#x43D;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x43A;&#x43E;&#x43B;&#x43E;&#x432; &#x43B;&#x44C;&#x432;&#x438;&#x43D;&#x443;&#x44E; &#x434;&#x43E;&#x43B;&#x44E; &#x437;&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x442; HTTP. &#x418;&#x437;&#x443;&#x447;&#x430;&#x44F; &#x43D;&#x44E;&#x430;&#x43D;&#x441;&#x44B; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x432;&#x435;&#x431;-&#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;, &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x43E; &#x443;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43C;&#x430;&#x43B;&#x43E; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x44F; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x435;, &#x433;&#x434;&#x435; &#x44D;&#x442;&#x438; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x44E;&#x442;&#x441;&#x44F;. &#x420;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; (Dev) &#x438; &#x44D;&#x43A;&#x441;&#x43F;&#x43B;&#x443;&#x430;&#x442;&#x430;&#x446;&#x438;&#x438; (Ops) &#x43B;&#x438;&#x448;&#x44C; &#x443;&#x445;&#x443;&#x434;&#x448;&#x430;&#x43B;&#x43E; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x44E;. &#x41D;&#x43E; &#x441; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x43A;&#x443;&#x43B;&#x44C;&#x442;&#x443;&#x440;&#x44B; DevOps &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x438; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x44E;&#x442; &#x43D;&#x435;&#x441;&#x442;&#x438; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x437;&#x430; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A; &#x441;&#x432;&#x43E;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x43A;&#x435;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x434;&#x43B;&#x44F; &#x43D;&#x438;&#x445; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x43E; &#x434;&#x43E;&#x441;&#x43A;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x441; &#x431;&#x44D;&#x43A;&#x435;&#x43D;&#x434;&#x43E;&#x43C; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B;. &#x42D;&#x442;&#x43E; &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x43E;, &#x435;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x43F;&#x44B;&#x442;&#x430;&#x435;&#x442;&#x435;&#x441;&#x44C; &#x440;&#x430;&#x437;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x44C; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x443; &#x434;&#x43B;&#x44F; &#x442;&#x44B;&#x441;&#x44F;&#x447; &#x438;&#x43B;&#x438; &#x434;&#x435;&#x441;&#x44F;&#x442;&#x43A;&#x43E;&#x432; &#x442;&#x44B;&#x441;&#x44F;&#x447; &#x43E;&#x434;&#x43D;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x439;. &#x41E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x432;&#x435;&#x431;-&#x441;&#x43B;&#x443;&#x436;&#x431;&#x430;&#x445; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x438; &#x43D;&#x430; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;&#x445;. &#x411;&#x443;&#x434;&#x44C; &#x442;&#x43E; &#x431;&#x430;&#x43B;&#x430;&#x43D;&#x441;&#x438;&#x440;&#x43E;&#x432;&#x449;&#x438;&#x43A;&#x438; &#x43D;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438; &#x438;&#x43B;&#x438; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x44B; &#x411;&#x414;, &#x443; &#x432;&#x441;&#x435;&#x445; &#x44D;&#x442;&#x438;&#x445; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; &#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x433;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x44B; &#x432; &#x432;&#x44B;&#x441;&#x43E;&#x43A;&#x43E;&#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x441;&#x440;&#x435;&#x434;&#x435;. &#x41F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435; &#x44D;&#x442;&#x438;&#x445; &#x444;&#x443;&#x43D;&#x434;&#x430;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x438; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x432; &#x438;&#x445; &#x43F;&#x440;&#x435;&#x43E;&#x434;&#x43E;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x446;&#x435;&#x43B;&#x43E;&#x43C; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442; &#x43E;&#x446;&#x435;&#x43D;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x438; &#x43C;&#x430;&#x441;&#x448;&#x442;&#x430;&#x431;&#x438;&#x440;&#x443;&#x435;&#x43C;&#x43E;&#x441;&#x442;&#x44C; &#x432;&#x430;&#x448;&#x438;&#x445; &#x432;&#x435;&#x431;-&#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;. &#x42F; &#x43F;&#x438;&#x448;&#x443; &#x44D;&#x442;&#x443; &#x441;&#x435;&#x440;&#x438;&#x44E; &#x441;&#x442;&#x430;&#x442;&#x435;&#x439; &#x432; &#x43E;&#x442;&#x432;&#x435;&#x442; &#x43D;&#x430; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x44B; &#x43C;&#x43E;&#x43B;&#x43E;&#x434;&#x44B;&#x445; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x445;&#x43E;&#x442;&#x44F;&#x442; &#x441;&#x442;&#x430;&#x442;&#x44C; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x43E; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x43D;&#x44B;&#x43C;&#x438; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x430;&#x43C;&#x438;. &#x41D;&#x435;&#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x447;&#x451;&#x442;&#x43A;&#x43E; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x44B; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439; Linux, &#x43D;&#x435; &#x43F;&#x43E;&#x433;&#x440;&#x443;&#x437;&#x438;&#x432;&#x448;&#x438;&#x441;&#x44C; &#x432; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x44B;, &#x43A;&#x430;&#x43A; &#x43E;&#x43D;&#x438; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x442; &#x43D;&#x430; &#x443;&#x440;&#x43E;&#x432;&#x43D;&#x435; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B;. &#x425;&#x43E;&#x442;&#x44F; &#x435;&#x441;&#x442;&#x44C; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x438;&#x43F;&#x43E;&#x432; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x439;, &#x432; &#x44D;&#x442;&#x43E;&#x43C; &#x446;&#x438;&#x43A;&#x43B;&#x435; &#x44F; &#x445;&#x43E;&#x447;&#x443; &#x438;&#x441;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x435;&#x442;&#x435;&#x432;&#x44B;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x430; &#x43D;&#x435; &#x434;&#x435;&#x441;&#x43A;&#x442;&#x43E;&#x43F;&#x43D;&#x44B;&#x435;, &#x442;&#x430;&#x43A;&#x438;&#x435; &#x43A;&#x430;&#x43A; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; &#x438;&#x43B;&#x438; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x44B;&#x439; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x43E;&#x440;. &#x42D;&#x442;&#x43E;&#x442; &#x43C;&#x430;&#x442;&#x435;&#x440;&#x438;&#x430;&#x43B; &#x440;&#x430;&#x441;&#x441;&#x447;&#x438;&#x442;&#x430;&#x43D; &#x43D;&#x430; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x43E;&#x432; &#x438; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x445;&#x43E;&#x442;&#x44F;&#x442; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x44C;, &#x43A;&#x430;&#x43A; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x442; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x44B; Linux &#x438;&#x43B;&#x438; Unix &#x438; &#x43A;&#x430;&#x43A; &#x438;&#x445; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x432;&#x44B;&#x441;&#x43E;&#x43A;&#x43E;&#x439; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;.</div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/post/455212/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455156"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article"><i>&#x41F;&#x435;&#x440;&#x435;&#x434; &#x447;&#x442;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x430;&#x43F;&#x433;&#x440;&#x435;&#x439;&#x434;&#x430; &#x436;&#x435;&#x43B;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43E;&#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x441; <a href="https://habr.com/ru/post/408139/">&#x43E;&#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x43C; &#x440;&#x430;&#x43D;&#x435;&#x435; &#x438;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x438;&#x43A;&#x43E;&#x43C;</a>. </i> &#x421;&#x430;&#x43C;&#x44B;&#x439; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439; &#x438; &#x441;&#x430;&#x43C;&#x44B;&#x439; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x440;&#x43D;&#x44B;&#x439; &#x43D;&#x430; &#x441;&#x435;&#x433;&#x43E;&#x434;&#x43D;&#x44F;&#x448;&#x43D;&#x438;&#x439; &#x434;&#x435;&#x43D;&#x44C; &#x43D;&#x430;&#x43D;&#x43E;&#x43F;&#x43E;&#x440;&#x43E;&#x432;&#x44B;&#x439; &#x441;&#x435;&#x43A;&#x432;&#x435;&#x43D;&#x430;&#x442;&#x43E;&#x440; MinION (&#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x43C;&#x43F;&#x43B;&#x435;&#x43A;&#x442; &#x432; UK &#x2014; $1000, &#x432; &#x420;&#x43E;&#x441;&#x441;&#x438;&#x438; &#x2013; 150 &#x442;&#x44B;&#x441;. &#x440;&#x443;&#x431;.), &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x43C;&#x43F;&#x430;&#x43D;&#x438;&#x435;&#x439; Oxford Nanopore Technologies (ONT), &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x43D;&#x430; &#x43E;&#x434;&#x43D;&#x43E;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x44B;&#x445; &#x44F;&#x447;&#x435;&#x439;&#x43A;&#x430;&#x445;, &#x43A;&#x430;&#x436;&#x434;&#x430;&#x44F; &#x438;&#x437; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x441;&#x442;&#x43E;&#x438;&#x442; $900 (&#x432; &#x420;&#x43E;&#x441;&#x441;&#x438;&#x438; &#x2013; 135 &#x442;&#x44B;&#x441;. &#x440;&#x443;&#x431;.). &#x422;&#x430;&#x43A;&#x438;&#x435; &#x44F;&#x447;&#x435;&#x439;&#x43A;&#x438; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442; &#x437;&#x430; 2&#x2026;3 &#x434;&#x43D;&#x44F; &#x43E;&#x446;&#x438;&#x444;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x414;&#x41D;&#x41A; &#x434;&#x43B;&#x438;&#x43D;&#x43E;&#x439; 10&#x2026;20 Gb. &#x42D;&#x442;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x43C; &#x43C;&#x430;&#x43B;&#x43E; &#x434;&#x43B;&#x44F; &#x441;&#x435;&#x43A;&#x432;&#x435;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x433;&#x435;&#x43D;&#x43E;&#x43C;&#x430; &#x447;&#x435;&#x43B;&#x43E;&#x432;&#x435;&#x43A;&#x430; (&#x43D;&#x443;&#x436;&#x43D;&#x43E; &gt;100 Gb), &#x43D;&#x43E; &#x441;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x43C; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x435;&#x445; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x445; &#x43A;&#x43B;&#x438;&#x43D;&#x438;&#x43A;&#x43E;-&#x434;&#x438;&#x430;&#x433;&#x43D;&#x43E;&#x441;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x445; &#x446;&#x435;&#x43B;&#x435;&#x439; (&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &lt;1 Gb). &#x41D;&#x435;&#x434;&#x430;&#x432;&#x43D;&#x43E; &#x441;&#x442;&#x430;&#x440;&#x442;&#x43E;&#x432;&#x430;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x434;&#x430;&#x436;&#x438; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; (&#x438; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x434;&#x43E;&#x440;&#x43E;&#x433;&#x438;&#x445;) &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x435;&#x439; &#x2013; PromethION 24/48 ($165 000/$285 000), &#x43D;&#x430;&#x446;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x43D;&#x430; &#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x435; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x433;&#x435;&#x43D;&#x43E;&#x43C;&#x43D;&#x43E;&#x435; &#x441;&#x435;&#x43A;&#x432;&#x435;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;. &#x414;&#x43E;&#x440;&#x43E;&#x436;&#x435; &#x441;&#x442;&#x43E;&#x44F;&#x442; &#x438; &#x438;&#x445; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x440;&#x430;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x435; &#x44F;&#x447;&#x435;&#x439;&#x43A;&#x438; ($2 000/&#x448;&#x442;., &gt;100 Gb). &#x41F;&#x440;&#x430;&#x432;&#x434;&#x430;, &#x43E;&#x43F;&#x442;&#x43E;&#x43C; &#x43E;&#x43D;&#x438; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x441;&#x442;&#x43E;&#x438;&#x442;&#x44C; &#x434;&#x435;&#x448;&#x435;&#x432;&#x43B;&#x435; ($1 800 000 &#x437;&#x430; 720 &#x448;&#x442;., $625/&#x448;&#x442;.), &#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x441;&#x441;&#x438;&#x439;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x431;&#x44E;&#x434;&#x436;&#x435;&#x442;&#x430; &#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x435; &#x43F;&#x440;&#x438;&#x43E;&#x431;&#x440;&#x435;&#x442;&#x435;&#x43D;&#x438;&#x44F; (200&#x2026;250 &#x43C;&#x43B;&#x43D;. &#x440;&#x443;&#x431;. &#x437;&#x430; &#x43F;&#x430;&#x440;&#x442;&#x438;&#x44E;) &#x43D;&#x435;&#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;. &#x414;&#x430; &#x438; &#x43D;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x434;&#x43B;&#x44F; &#x440;&#x43E;&#x441;&#x441;&#x438;&#x439;&#x441;&#x43A;&#x43E;&#x433;&#x43E;. &#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x441;&#x435;&#x442;&#x438;&#x442;&#x435;&#x43B;&#x435;&#x439; &#x43D;&#x435;&#x434;&#x430;&#x432;&#x43D;&#x435;&#x439; (22-24 &#x43C;&#x430;&#x44F;) &#x43A;&#x43E;&#x43D;&#x444;&#x435;&#x440;&#x435;&#x43D;&#x446;&#x438;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x430;&#x43D;&#x438;&#x438; ONT &#x43F;&#x440;&#x438;&#x432;&#x43B;&#x435;&#x43A;&#x43B;&#x43E; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x435; &#x43E; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x435; &#x43F;&#x440;&#x43E;&#x434;&#x430;&#x436; Flongle &#x2014; &#x430;&#x434;&#x430;&#x43F;&#x442;&#x43E;&#x440;&#x43D;&#x43E;&#x439; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43A;&#x438; &#x43A; &#x441;&#x435;&#x43A;&#x432;&#x435;&#x43D;&#x430;&#x442;&#x43E;&#x440;&#x443; MinION, &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x449;&#x435;&#x439; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x441; &#x43C;&#x435;&#x43D;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C;&#x438; (~1 Gb), &#x43D;&#x43E; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x434;&#x435;&#x448;&#x451;&#x432;&#x44B;&#x43C;&#x438; ($90) &#x43E;&#x434;&#x43D;&#x43E;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x44B;&#x43C;&#x438; &#x44F;&#x447;&#x435;&#x439;&#x43A;&#x430;&#x43C;&#x438;. <p> <img src="https://habrastorage.org/webt/ik/ul/db/ikuldb6gzu6oq4pxn6gbhtuys9e.png"></p> <p> <a href="https://nanoporetech.com/products">https://nanoporetech.com/products</a></p> &#x41F;&#x43E;&#x44F;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; Flongle &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43D;&#x43E; &#x432;&#x44B;&#x437;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x437;&#x440;&#x44B;&#x432;&#x43D;&#x43E;&#x439; &#x440;&#x43E;&#x441;&#x442; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F; NGS (next generation sequencing) &#x432; &#x43A;&#x43B;&#x438;&#x43D;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x439; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x43A;&#x435; &#x438; &#x43F;&#x43E;&#x442;&#x435;&#x441;&#x43D;&#x438;&#x442;&#x44C; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x443;&#x44E; &#x41F;&#x426;&#x420;-&#x434;&#x438;&#x430;&#x433;&#x43D;&#x43E;&#x441;&#x442;&#x438;&#x43A;&#x443;, &#x43E;&#x431;&#x44A;&#x451;&#x43C; &#x440;&#x44B;&#x43D;&#x43A;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x432; &#x420;&#x43E;&#x441;&#x441;&#x438;&#x438; &#x43F;&#x440;&#x435;&#x432;&#x44B;&#x448;&#x430;&#x435;&#x442; &#x43C;&#x438;&#x43B;&#x43B;&#x438;&#x430;&#x440;&#x434; &#x440;&#x443;&#x431;&#x43B;&#x435;&#x439;, &#x430; &#x432; &#x43C;&#x438;&#x440;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x440;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43C;&#x438;&#x43B;&#x43B;&#x438;&#x430;&#x440;&#x434;&#x430;&#x43C;&#x438; &#x434;&#x43E;&#x43B;&#x43B;&#x430;&#x440;&#x43E;&#x432;. &#x41D;&#x43E; &#x434;&#x43B;&#x44F; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x430; &#x440;&#x43E;&#x441;&#x441;&#x438;&#x439;&#x441;&#x43A;&#x438;&#x445; &#x43F;&#x430;&#x446;&#x438;&#x435;&#x43D;&#x442;&#x43E;&#x432; NGS-&#x434;&#x438;&#x430;&#x433;&#x43D;&#x43E;&#x441;&#x442;&#x438;&#x43A;&#x430; &#x43F;&#x43E;-&#x43F;&#x440;&#x435;&#x436;&#x43D;&#x435;&#x43C;&#x443; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x435;&#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x440;&#x43E;&#x441;&#x43A;&#x43E;&#x448;&#x44C;&#x44E;, &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x441;&#x442;&#x43E;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x44C; &#x44F;&#x447;&#x435;&#x435;&#x43A; &#x43A; Flongle &#x43D;&#x430; &#x43E;&#x442;&#x435;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x43C; &#x440;&#x44B;&#x43D;&#x43A;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44B;&#x448;&#x435; 10 &#x442;&#x44B;&#x441;&#x44F;&#x447; &#x440;&#x443;&#x431;&#x43B;&#x435;&#x439;. &#x410; &#x435;&#x441;&#x43B;&#x438; &#x43A; &#x43D;&#x435;&#x439; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x441;&#x442;&#x43E;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x44C; &#x440;&#x430;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x445; &#x440;&#x435;&#x430;&#x433;&#x435;&#x43D;&#x442;&#x43E;&#x432;, &#x442;&#x440;&#x430;&#x43D;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x43D;&#x44B;&#x435; &#x438;&#x437;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438; &#x438; &#x43D;&#x430;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x44B;&#x435; &#x440;&#x430;&#x441;&#x445;&#x43E;&#x434;&#x44B;, &#x442;&#x43E; &#x440;&#x430;&#x441;&#x447;&#x451;&#x442;&#x43D;&#x430;&#x44F; &#x446;&#x435;&#x43D;&#x430; &#x441;&#x435;&#x43A;&#x432;&#x435;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x43F;&#x440;&#x43E;&#x431;&#x44B; &#x414;&#x41D;&#x41A;/&#x420;&#x41D;&#x41A; &#x43D;&#x435; &#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x441;&#x44F; &#x43D;&#x438;&#x436;&#x435; 20 &#x442;&#x44B;&#x441;&#x44F;&#x447; &#x440;&#x443;&#x431;&#x43B;&#x435;&#x439;. &#x41E;&#x442;&#x441;&#x44E;&#x434;&#x430; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x44C; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x43E;&#x442;&#x435;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43D;&#x430;&#x43D;&#x43E;&#x43F;&#x43E;&#x440;&#x43E;&#x432;&#x44B;&#x445; &#x441;&#x435;&#x43A;&#x432;&#x435;&#x43D;&#x430;&#x442;&#x43E;&#x440;&#x43E;&#x432; &#x438; &#x438;&#x445; &#x43E;&#x431;&#x435;&#x441;&#x43F;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x435;&#x448;&#x451;&#x432;&#x44B;&#x43C;&#x438; &#x440;&#x430;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x44B;&#x43C;&#x438; &#x43C;&#x430;&#x442;&#x435;&#x440;&#x438;&#x430;&#x43B;&#x430;&#x43C;&#x438; &#x438; &#x440;&#x435;&#x430;&#x433;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;.</div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/post/455156/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455164"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article"><img src="https://habrastorage.org/webt/ue/hg/ge/uehgges3d3doskuxgukcvvbg_ju.jpeg"> <p> <i>&#x413;&#x43E;&#x434; &#x43D;&#x430;&#x437;&#x430;&#x434; &#x430;&#x434;&#x43C;&#x438;&#x43D;&#x438;&#x441;&#x442;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x422;&#x43E;&#x43B;&#x44C;&#x44F;&#x442;&#x442;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x435;&#x43B;&#x430; &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x432;&#x441;&#x435; &#x441;&#x432;&#x43E;&#x438; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x43D;&#x435;&#x442;-&#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x44B; &#x43D;&#x430; &#x43B;&#x438;&#x446;&#x435;&#x43D;&#x437;&#x438;&#x44E; Creative Commons Attribution, &#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x441;&#x432;&#x43E;&#x435;&#x433;&#x43E; &#x413;&#x418;&#x421;-&#x43F;&#x43E;&#x440;&#x442;&#x430;&#x43B;&#x430; &#x43F;&#x435;&#x440;&#x441;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x440;&#x430;&#x437;&#x440;&#x435;&#x448;&#x438;&#x43B;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443; OpenStreetMap. &#x41F;&#x43E;&#x447;&#x435;&#x43C;&#x443; &#x43E;&#x43D;&#x438; &#x440;&#x435;&#x448;&#x438;&#x43B;&#x438; &#x44D;&#x442;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C;, &#x43E;&#x442;&#x447;&#x435;&#x433;&#x43E; &#x447;&#x438;&#x43D;&#x43E;&#x432;&#x43D;&#x438;&#x43A;&#x438; &#x431;&#x43E;&#x44F;&#x442;&#x441;&#x44F; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x44B;&#x445; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x438; &#x43A;&#x430;&#x43A; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x434;&#x43E;&#x431;&#x438;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x438;&#x445; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x2014; &#x43E;&#x431;&#x43E; &#x432;&#x441;&#x435;&#x43C; &#x44D;&#x442;&#x43E;&#x43C; &#x432; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x432;&#x44C;&#x44E; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x430; &#x440;&#x443;&#x43A;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C; &#x434;&#x435;&#x43F;&#x430;&#x440;&#x442;&#x430;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x445; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x439; &#x438; &#x441;&#x432;&#x44F;&#x437;&#x438; &#x430;&#x434;&#x43C;&#x438;&#x43D;&#x438;&#x441;&#x442;&#x440;&#x430;&#x446;&#x438;&#x438; &#x433;.&#x43E;. &#x422;&#x43E;&#x43B;&#x44C;&#x44F;&#x442;&#x442;&#x438; &#x415;&#x43B;&#x435;&#x43D;&#x430; &#x411;&#x430;&#x43B;&#x430;&#x448;&#x43E;&#x432;&#x430;.</i></p><br></div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/post/455164/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455032"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article"><img src="https://habrastorage.org/webt/oe/43/az/oe43azaw9lesane8hxrm8tk1rha.jpeg"> &#x422;&#x435;&#x43B;&#x43E; &#x447;&#x435;&#x43B;&#x43E;&#x432;&#x435;&#x43A;&#x430; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x438;&#x442;&#x44C; &#x441; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44B;&#x43C; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x438;&#x437;&#x43C;&#x43E;&#x43C;, &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x449;&#x438;&#x43C; &#x438;&#x437; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x430; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x442; &#x441;&#x43B;&#x430;&#x436;&#x435;&#x43D;&#x43D;&#x43E; &#x438; &#x441;&#x432;&#x43E;&#x435;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x435;&#x441;&#x43F;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x436;&#x438;&#x437;&#x43D;&#x435;&#x434;&#x435;&#x44F;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x440;&#x430;&#x432;&#x43D;&#x438;&#x442;&#x44C; &#x438; &#x441; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x43E;&#x439;, &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x449;&#x435;&#x439; &#x438;&#x437; &#x442;&#x44B;&#x441;&#x44F;&#x447; &#x441;&#x442;&#x440;&#x43E;&#x43A; &#x43A;&#x43E;&#x434;&#x430;, &#x43A;&#x430;&#x436;&#x434;&#x430;&#x44F; &#x438;&#x437; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x442; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;. &#x41D;&#x43E;, &#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x441;&#x442;&#x44B; &#x43D;&#x435; &#x434;&#x430;&#x434;&#x443;&#x442; &#x43C;&#x43D;&#x435; &#x441;&#x43E;&#x432;&#x440;&#x430;&#x442;&#x44C;, &#x432; &#x43A;&#x43E;&#x434;&#x435; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x431;&#x44B;&#x432;&#x430;&#x44E;&#x442; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x438;&#x43B;&#x438; &#x43D;&#x435;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x41E;&#x434;&#x43D;&#x438; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x434;&#x44F;&#x442; &#x43A; &#x43D;&#x435;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43E;&#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x44B; &#x438;&#x43B;&#x438; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x435;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;, &#x434;&#x440;&#x443;&#x433;&#x438;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x44F;&#x442;&#x441;&#x44F; &#x43D;&#x435;&#x43E;&#x436;&#x438;&#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x444;&#x438;&#x447;&#x435;&#x439;, &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x44E;&#x449;&#x435;&#x439; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x443;. <p> &#x421;&#x435;&#x433;&#x43E;&#x434;&#x43D;&#x44F; &#x43C;&#x44B; &#x441; &#x432;&#x430;&#x43C;&#x438; &#x43F;&#x43E;&#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x438;&#x43C;&#x441;&#x44F; &#x441; &#x438;&#x441;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;&#x43C;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x443;&#x447;&#x435;&#x43D;&#x44B;&#x435; &#x440;&#x435;&#x448;&#x438;&#x43B;&#x438; &#x434;&#x435;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C; &#x43C;&#x43E;&#x442;&#x43E;&#x440;&#x438;&#x43A;&#x443; &#x438; &#x43D;&#x435;&#x439;&#x440;&#x43E;&#x43C;&#x435;&#x445;&#x430;&#x43D;&#x438;&#x43A;&#x443; &#x447;&#x435;&#x43B;&#x43E;&#x432;&#x435;&#x43A;&#x430;, &#x432; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x435; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x438;&#x43C;&#x435;&#x435;&#x442;&#x441;&#x44F; &#x43B;&#x438;&#x448;&#x43D;&#x44F;&#x44F; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x430; &#x43A;&#x43E;&#x434;&#x430; &#x2014; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x446;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x448;&#x435;&#x441;&#x442;&#x43E;&#x439; &#x43F;&#x430;&#x43B;&#x435;&#x446; &#x43D;&#x430; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x439; &#x440;&#x443;&#x43A;&#x435;. &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x43B;&#x438; &#x441;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x43E;&#x435; &#x43E;&#x442;&#x43A;&#x43B;&#x43E;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x44B;&#x43C;, &#x435;&#x441;&#x442;&#x44C; &#x43B;&#x438; &#x443; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x43B;&#x44E;&#x434;&#x435;&#x439; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430; &#x432; &#x43C;&#x43E;&#x442;&#x43E;&#x440;&#x438;&#x43A;&#x435;, &#x438; &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x438;&#x434;&#x435;&#x438; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x442;&#x435;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x43E;&#x437;&#x43D;&#x438;&#x43A;&#x43B;&#x438; &#x443; &#x438;&#x441;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439;? &#x41E;&#x442;&#x432;&#x435;&#x442;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x438; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x44B; &#x43C;&#x44B; &#x43D;&#x430;&#x439;&#x434;&#x435;&#x43C; &#x432; &#x434;&#x43E;&#x43A;&#x43B;&#x430;&#x434;&#x435; &#x443;&#x447;&#x435;&#x43D;&#x44B;&#x445;. &#x41F;&#x43E;&#x435;&#x445;&#x430;&#x43B;&#x438;.</p></div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/company/ua-hosting/blog/455032/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item"> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455158"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article">&#x42F; &#x43E;&#x431;&#x43E;&#x436;&#x430;&#x44E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x2013; &#x43E;&#x43D;&#x43E; &#x442;&#x432;&#x43E;&#x440;&#x438;&#x442; &#x447;&#x443;&#x434;&#x435;&#x441;&#x430;. &#x41D;&#x43E; &#x43E; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; &#x432;&#x430;&#x43C; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x43E; &#x433;&#x43E;&#x440;&#x430;&#x437;&#x434;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;, &#x447;&#x435;&#x43C; &#x43C;&#x43D;&#x435;. &#x41E;&#x434;&#x43D;&#x430;&#x43A;&#x43E; &#x447;&#x443;&#x434;&#x435;&#x441;&#x430; &#x432;&#x441;&#x442;&#x440;&#x435;&#x447;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43D;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x432; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438;, &#x43D;&#x43E; &#x434;&#x430;&#x436;&#x435; &#x432; &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x437;&#x430;&#x442;&#x445;&#x43B;&#x43E;&#x439; &#x438; &#x437;&#x430;&#x441;&#x43A;&#x43E;&#x440;&#x443;&#x437;&#x43B;&#x43E;&#x439; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438;, &#x43A;&#x430;&#x43A; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43B;&#x442;&#x435;&#x440;&#x441;&#x43A;&#x438;&#x439; &#x443;&#x447;&#x435;&#x442;. &#x414;&#x430;-&#x434;&#x430;, &#x432; &#x43D;&#x435;&#x439; &#x441;&#x430;&#x43C;&#x43E;&#x439; &#x2013; &#x432; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43B;&#x442;&#x435;&#x440;&#x438;&#x438;, &#x43A; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x44F; &#x438;&#x441;&#x43F;&#x44B;&#x442;&#x44B;&#x432;&#x430;&#x44E; &#x430;&#x43C;&#x431;&#x438;&#x432;&#x430;&#x43B;&#x435;&#x43D;&#x442;&#x43D;&#x44B;&#x435; &#x447;&#x443;&#x432;&#x441;&#x442;&#x432;&#x430;: &#x438;&#x441;&#x43A;&#x440;&#x435;&#x43D;&#x43D;&#x44E;&#x44E; &#x438; &#x433;&#x43E;&#x440;&#x44F;&#x447;&#x443;&#x44E; &#x441;&#x438;&#x43C;&#x43F;&#x430;&#x442;&#x438;&#x44E; (&#x432;&#x441;&#x435;-&#x442;&#x430;&#x43A;&#x438; &#x44D;&#x442;&#x43E; &#x43C;&#x43E;&#x44F; &#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x43F;&#x440;&#x43E;&#x444;&#x435;&#x441;&#x441;&#x438;&#x44F;) &#x438; &#x43D;&#x435; &#x43C;&#x435;&#x43D;&#x435;&#x435; &#x437;&#x430;&#x441;&#x442;&#x430;&#x440;&#x435;&#x43B;&#x443;&#x44E; &#x438; &#x441;&#x442;&#x440;&#x430;&#x441;&#x442;&#x43D;&#x443;&#x44E; &#x43D;&#x435;&#x43D;&#x430;&#x432;&#x438;&#x441;&#x442;&#x44C; (&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x435; &#x43F;&#x440;&#x43E; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43B;&#x442;&#x435;&#x440;&#x438;&#x44E; &#x437;&#x43D;&#x430;&#x44E;, &#x447;&#x442;&#x43E; &#x432;&#x430;&#x43C; &#x438; &#x43D;&#x435; &#x441;&#x43D;&#x438;&#x43B;&#x43E;&#x441;&#x44C;). &#x41D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x440;&#x430;&#x437; &#x441;&#x43E;&#x441;&#x440;&#x435;&#x434;&#x43E;&#x442;&#x43E;&#x447;&#x438;&#x43C;&#x441;&#x44F; &#x43D;&#x430; &#x43F;&#x43E;&#x437;&#x438;&#x442;&#x438;&#x432;&#x435;. &#x41F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44C;&#x442;&#x435; &#x43C;&#x43D;&#x435; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x43E;&#x431; &#x43E;&#x434;&#x43D;&#x43E;&#x43C; &#x447;&#x443;&#x434;&#x435;&#x441;&#x43D;&#x43E;&#x43C; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x435;&#x442;&#x435;&#x43D;&#x438;&#x438; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x443;&#x447;&#x435;&#x442;&#x43D;&#x43E;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x438; &#x43F;&#x43E;&#x434; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x435;&#x43C; &#xAB;&#x430;&#x43C;&#x43E;&#x440;&#x442;&#x438;&#x437;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x439; &#x444;&#x43E;&#x43D;&#x434;&#xBB;. <p> <img src="https://habrastorage.org/webt/dk/c9/at/dkc9atidw4ypyces7n_-ntplo_y.jpeg"></p><br></div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/post/455158/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455138"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article">&#x412; &#x430;&#x43F;&#x440;&#x435;&#x43B;&#x435; &#x43C;&#x44B; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x43B;&#x438; <b>JetBrains Night Moscow</b> &#x2014; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B;&#x430;&#x441;&#x44C; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x430;&#x44F; &#x432;&#x441;&#x442;&#x440;&#x435;&#x447;&#x430; &#x441; &#x434;&#x440;&#x443;&#x437;&#x44C;&#x44F;&#x43C;&#x438;: &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x44B;&#x435; &#x442;&#x435;&#x43C;&#x44B;, &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x436;&#x438;&#x432;&#x43E;&#x433;&#x43E; &#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x438;, &#x43A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E;, &#x432;&#x44B;&#x441;&#x442;&#x443;&#x43F;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x43F;&#x438;&#x43A;&#x435;&#x440;&#x43E;&#x432; JetBrains. &#x41A; &#x43D;&#x430;&#x43C; &#x43F;&#x440;&#x438;&#x448;&#x43B;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; 700 &#x433;&#x43E;&#x441;&#x442;&#x435;&#x439;. &#x421;&#x43F;&#x430;&#x441;&#x438;&#x431;&#x43E; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x43C;&#x443; &#x437;&#x430; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x432;&#x44B; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43B;&#x438; &#x432;&#x435;&#x447;&#x435;&#x440; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x43D;&#x44B;&#x43C;! <div class="oembed"><div><div><iframe src="https://www.youtube.com/embed/shOgyqDzTP8?rel=0&amp;showinfo=1&amp;hl=en-US" class></iframe></div></div></div></div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/company/JetBrains/blog/455138/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455110"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article"><img src="https://habrastorage.org/webt/dx/0y/os/dx0yosvrxa7eoauu5o7ybefmlmk.png" alt="image"> &#x425;&#x43E;&#x442;&#x44C; &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; &#x438; &#x43C;&#x430;&#x43B;&#x43E; &#x43A;&#x43E;&#x433;&#x43E; &#x437;&#x430;&#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x443;&#x435;&#x448;&#x44C; &#xAB;&#x43F;&#x435;&#x447;&#x435;&#x43D;&#x44C;&#x43A;&#x430;&#x43C;&#x438;&#xBB; &#x438; &#xAB;&#x43A;&#x438;&#x43A;&#x435;&#x440;&#x43E;&#x43C; &#x432; &#x43E;&#x444;&#x438;&#x441;&#x435;&#xBB;, &#x44D;&#x439;&#x447;&#x430;&#x440;&#x44B; &#x434;&#x43E; &#x441;&#x438;&#x445; &#x43F;&#x43E;&#x440; &#x432; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F;&#x445; &#x432;&#x430;&#x43A;&#x430;&#x43D;&#x441;&#x438;&#x439; &#x43C;&#x430;&#x448;&#x438;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x44E;&#x442; &#x443;&#x43F;&#x43E;&#x440; &#x43D;&#x430; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x43E;&#x43C; &#x440;&#x430;&#x441;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x438; &#x43E;&#x444;&#x438;&#x441;&#x430;, &#x431;&#x435;&#x441;&#x43F;&#x43B;&#x430;&#x442;&#x43D;&#x43E;&#x43C; &#x43A;&#x43E;&#x444;&#x435; &#x438; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x43D;&#x44B;&#x445; &#x442;&#x438;&#x43C;&#x431;&#x438;&#x43B;&#x434;&#x438;&#x43D;&#x433;&#x430;&#x445;. &#x41D;&#x43E; &#x44D;&#x442;&#x43E;, &#x441;&#x43A;&#x43E;&#x440;&#x435;&#x435;, &#x432;&#x435;&#x440;&#x445;&#x443;&#x448;&#x43A;&#x430; &#x430;&#x439;&#x441;&#x431;&#x435;&#x440;&#x433;&#x430;, &#x43F;&#x440;&#x438;&#x44F;&#x442;&#x43D;&#x43E;&#x435; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x43A; &#x442;&#x43E;&#x43C;&#x443;, &#x447;&#x442;&#x43E; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x430;&#x442;&#x44C; &#x441;&#x43E;&#x442;&#x440;&#x443;&#x434;&#x43D;&#x438;&#x43A;&#x443; &#x441;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x44F;&#x442;&#x44C; &#x441;&#x442;&#x440;&#x430;&#x441;&#x442;&#x44C; &#x43A; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x435; &#x438; &#x43D;&#x435; &#x432;&#x44B;&#x433;&#x43E;&#x440;&#x435;&#x442;&#x44C; &#x43D;&#x430; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x43C; &#x436;&#x435; &#x433;&#x43E;&#x434;&#x443; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x432; &#x43A;&#x43E;&#x43C;&#x43F;&#x430;&#x43D;&#x438;&#x438;. &#x410; &#xAB;&#x43F;&#x43E;&#x434; &#x432;&#x43E;&#x434;&#x43E;&#x439;&#xBB; &#x2014; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x44B;&#x435; &#x438; &#x440;&#x430;&#x437;&#x43D;&#x43E;&#x43F;&#x43B;&#x430;&#x43D;&#x43E;&#x432;&#x44B;&#x435; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x431;&#x440;&#x43E;&#x441;&#x430;&#x44E;&#x442; &#x432;&#x44B;&#x437;&#x43E;&#x432; &#x43D;&#x430;&#x448;&#x438;&#x43C; &#x441;&#x43A;&#x438;&#x43B;&#x43B;&#x430;&#x43C; &#x438; &#x437;&#x430;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x44B;&#x435; &#x437;&#x43D;&#x430;&#x43D;&#x438;&#x44F;, &#x438; &#x431;&#x43B;&#x430;&#x433;&#x43E;&#x434;&#x430;&#x440;&#x44F; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x434;&#x435;&#x43D;&#x44C; &#x43C;&#x44B; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x43C; &#x43D;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x443; &#x441; &#x443;&#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x441;&#x442;&#x432;&#x438;&#x435;&#x43C;. <p> &#x41C;&#x44B; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x430;&#x435;&#x43C; &#x43E;&#x431;&#x441;&#x443;&#x436;&#x434;&#x430;&#x442;&#x44C; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x430; &#x43A;&#x43E;&#x43C;&#x43F;&#x430;&#x43D;&#x438;&#x439;, &#x437;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43E;&#x43D;&#x438; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x44E;&#x442; &#x43D;&#x430;&#x438;&#x432;&#x44B;&#x441;&#x448;&#x443;&#x44E; &#x43E;&#x446;&#x435;&#x43D;&#x43A;&#x443; &#x43E;&#x442; &#x441;&#x432;&#x43E;&#x438;&#x445; &#x441;&#x43E;&#x442;&#x440;&#x443;&#x434;&#x43D;&#x438;&#x43A;&#x43E;&#x432; &#x43D;&#x430; &#x43D;&#x430;&#x448;&#x435;&#x43C; &#x441;&#x435;&#x440;&#x432;&#x438;&#x441;&#x435;. &#x412; <a href="https://habr.com/ru/company/moikrug/blog/449676/">&#x43F;&#x440;&#x43E;&#x448;&#x43B;&#x43E;&#x43C; &#x432;&#x44B;&#x43F;&#x443;&#x441;&#x43A;&#x435;</a> &#x441;&#x43E;&#x442;&#x440;&#x443;&#x434;&#x43D;&#x438;&#x43A;&#x438; Kolesa Group, Evil Martians &#x438; Wrike &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x438; &#x43F;&#x43E;&#x447;&#x435;&#x43C;&#x443; &#x438; &#x43D;&#x430;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x438;&#x43C; &#x432;&#x430;&#x436;&#x435;&#x43D; &#x433;&#x440;&#x430;&#x43C;&#x43E;&#x442;&#x43D;&#x44B;&#x439; &#x43C;&#x435;&#x43D;&#x435;&#x434;&#x436;&#x43C;&#x435;&#x43D;&#x442; &#x432; &#x43A;&#x43E;&#x43C;&#x43F;&#x430;&#x43D;&#x438;&#x438;, &#x430; &#x441;&#x435;&#x433;&#x43E;&#x434;&#x43D;&#x44F; &#x43C;&#x44B; &#x440;&#x430;&#x441;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x438;&#x43B;&#x438; Staply, &#x421;&#x41A;&#x411; &#x41A;&#x43E;&#x43D;&#x442;&#x443;&#x440;, Dodo Pizza &#x438; Alternativa Games &#x43E; &#x442;&#x43E;&#x43C;, &#x43A;&#x430;&#x43A; &#x43E;&#x43D;&#x438; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x44E;&#x442; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E; &#xAB;&#x418;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x44B;&#x435; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438;&#xBB;, &#x43A;&#x430;&#x43A; &#x43D;&#x430;&#x43B;&#x438;&#x447;&#x438;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x437;&#x430;&#x434;&#x430;&#x447; &#x432;&#x43B;&#x438;&#x44F;&#x435;&#x442; &#x43D;&#x430; &#x443;&#x440;&#x43E;&#x432;&#x435;&#x43D;&#x44C; &#x441;&#x447;&#x430;&#x441;&#x442;&#x44C;&#x44F; &#x441;&#x43E;&#x442;&#x440;&#x443;&#x434;&#x43D;&#x438;&#x43A;&#x43E;&#x432; &#x438; &#x43D;&#x430; &#x440;&#x430;&#x437;&#x432;&#x438;&#x442;&#x438;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x430;&#x43D;&#x438;&#x438; &#x432; &#x446;&#x435;&#x43B;&#x43E;&#x43C;.</p></div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/company/moikrug/blog/455110/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> <li class="content-list__item content-list__item_post shortcuts_item" id="post_455136"> <article class="post post_preview"> <div class="post__body post__body_crop "> <div class="post__text post__text-html js-mediator-article"><p><img src="https://habrastorage.org/webt/7i/u_/px/7iu_pxr20dohiivhqdzo3ufbnxw.png"></p><br> <p><em>Techlead Skyeng &#x41A;&#x438;&#x440;&#x438;&#x43B;&#x43B; &#x420;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x439; (<a href="https://habr.com/ru/users/flashhhh/" class="user_link">flashhhh</a>) &#x432;&#x44B;&#x441;&#x442;&#x443;&#x43F;&#x430;&#x435;&#x442; &#x43D;&#x430; &#x43A;&#x43E;&#x43D;&#x444;&#x435;&#x440;&#x435;&#x43D;&#x446;&#x438;&#x44F;&#x445; &#x441; &#x434;&#x43E;&#x43A;&#x43B;&#x430;&#x434;&#x43E;&#x43C;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43E; &#x43D;&#x430;&#x432;&#x44B;&#x43A;&#x430;&#x445;, &#x440;&#x430;&#x437;&#x432;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x441;&#x442;&#x43E;&#x438;&#x442; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x43C;&#x443; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x435;&#x43C;&#x443; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x443;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x441;&#x442;&#x430;&#x442;&#x44C; &#x43B;&#x443;&#x447;&#x448;&#x438;&#x43C;. &#x42F; &#x43F;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x438;&#x43B; &#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x44D;&#x442;&#x43E;&#x439; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x435;&#x439; &#x441; &#x447;&#x438;&#x442;&#x430;&#x442;&#x435;&#x43B;&#x44F;&#x43C;&#x438; &#x425;&#x430;&#x431;&#x440;&#x44B;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E; &#x41A;&#x438;&#x440;&#x438;&#x43B;&#x43B;&#x443; &#x441;&#x43B;&#x43E;&#x432;&#x43E;.</em></p><br> <p>&#x41C;&#x438;&#x444; &#x43F;&#x440;&#x43E; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x435;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430; &#x433;&#x43B;&#x430;&#x441;&#x438;&#x442;, &#x447;&#x442;&#x43E; &#x43E;&#x43D;:</p><br> <ol> <li>&#x41F;&#x438;&#x448;&#x435;&#x442; &#x447;&#x438;&#x441;&#x442;&#x44B;&#x439; &#x43A;&#x43E;&#x434;</li> <li>&#x417;&#x43D;&#x430;&#x435;&#x442; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x439;</li> <li>&#x411;&#x44B;&#x441;&#x442;&#x440;&#x435;&#x435; &#x43A;&#x43E;&#x434;&#x438;&#x442; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438;</li> <li>&#x417;&#x43D;&#x430;&#x435;&#x442; &#x43A;&#x443;&#x447;&#x443; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x43E;&#x432; &#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x43E;&#x432; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;</li> <li>&#x423;&#x43C;&#x435;&#x435;&#x442; &#x43E;&#x442;&#x440;&#x435;&#x444;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x438;&#x442;&#x44C; &#x43B;&#x44E;&#x431;&#x43E;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x43E; Clean Code</li> <li>&#x41D;&#x435; &#x442;&#x440;&#x430;&#x442;&#x438;&#x442; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43D;&#x430; &#x43D;&#x435;&#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x441;&#x442;&#x441;&#x43A;&#x438;&#x435; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438;</li> <li>100% &#x43C;&#x430;&#x441;&#x442;&#x435;&#x440; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x43B;&#x44E;&#x431;&#x438;&#x43C;&#x43E;&#x439; &#x442;&#x435;&#x445;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x438;</li> </ol><br> <p>&#x422;&#x430;&#x43A; &#x432;&#x438;&#x434;&#x44F;&#x442; &#x438;&#x434;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43A;&#x430;&#x43D;&#x434;&#x438;&#x434;&#x430;&#x442;&#x43E;&#x432; HR&#x44B;, &#x438; &#x432;&#x430;&#x43A;&#x430;&#x43D;&#x441;&#x438;&#x438;, &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;, &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x44F;&#x442; &#x442;&#x43E;&#x436;&#x435; &#x442;&#x430;&#x43A;.</p><br> <p>&#x41D;&#x43E; &#x43C;&#x43E;&#x439; &#x43E;&#x43F;&#x44B;&#x442; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x442;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x43D;&#x435; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;.</p></div> <a class="btn btn_x-large btn_outline_blue post__habracut-btn" href="https://habr.com/ru/company/skyeng/blog/455136/#habracut">&#x427;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x2192;</a> </div> </article> </li> </ul> </div> </div> </section> </p> </div>
</div>
    </div>
    <footer>
        <div>created by buildstarted &copy; 2019 <a href="/about">about</a></div>
        <div>Share this page on social media: copy and paste this url https://linksfor.dev/</div>
    </footer>
    
</body>
</html>