<!DOCTYPE html>
<html lang="en">
<head>
    <title>
Servicios gratuitos para webmasters: scripts en castellano, intercambio de banners, redirecci&#xF3;n de URLS, espacio jur&#xED;dico -
linksfor.dev(s)
    </title>
	<link rel="alternate" type="application/rss+xml" title="Linksfor.dev(s) feed" href="https://linksfor.dev/feed.rss" />
    <meta charset="utf-8">
    <meta name="Description" content="A curated source of links that devs might find interesting. Updated around the clock." />
    <meta name="google" value="notranslate">
    <link rel="stylesheet" type="text/css" href="/style.css" />
</head>
<body>
    <div class="grid">
        
<div class="readable">
    <h1>Servicios gratuitos para webmasters: scripts en castellano, intercambio de banners, redirecci&#xF3;n de URLS, espacio jur&#xED;dico</h1>
    <div id="page"> <p class="posts"> <article class="post-16 post type-post status-publish format-standard has-post-thumbnail hentry category-noticias"> <header class="post-info"> <time class="post-time"> September 9, 2019 </time> <img width="700" src="http://contributing.md/wp-content/uploads/2019/09/LZ1VE-700x388.png" class="post-image wp-post-image" alt srcset="http://contributing.md/wp-content/uploads/2019/09/LZ1VE-700x388.png 700w, http://contributing.md/wp-content/uploads/2019/09/LZ1VE-300x166.png 300w, http://contributing.md/wp-content/uploads/2019/09/LZ1VE-768x426.png 768w, http://contributing.md/wp-content/uploads/2019/09/LZ1VE.png 802w" sizes="(max-width: 700px) 100vw, 700px"> </header> <div class="post-content"> <p>Los SSI (server-side includes, que se podr&#xED;a traducir como &#x201C;inclusiones del lado del servidor&#x201D; o algo as&#xED;), se utilizan para introducir contenido din&#xE1;mico en las p&#xE1;ginas. Una breve l&#xED;nea inscrita en el c&#xF3;digo html, con una sintaxis especial, ordenar&#xE1; al servidor que ejecute una acci&#xF3;n que modificar&#xE1; el contenido de la p&#xE1;gina.</p>
<p>Por regla general, los SSI s&#xF3;lo se pueden incluir en p&#xE1;ginas que acaben con la extensi&#xF3;n .shtml, a menos que el servidor est&#xE9; configurado para aceptarlos tambi&#xE9;n en p&#xE1;ginas .html. De cualquier modo, inf&#xF3;rmate sobre si tu servidor admite SSI, pues no todos (en particular los gratuitos) lo hacen.</p>
<p>Los tipos de comandos m&#xE1;s utilizados son &#x201C;include virtual&#x201D; , &#x201C;exec cgi&#x201D; y &#x201C;echo var&#x201D;. Los del primer tipo se utilizan para incluir un contenido situado en otra p&#xE1;gina. &#x201C;Exec cgi&#x201D; sirve para ejecutar un script. &#x201C;Echo var&#x201D;, para mostrar informaciones procedentes del servidor, como la hora o el navegador utilizado por el visitante.</p>
<p>El c&#xF3;digo consta siempre de dos partes. La primera representa el tipo de acci&#xF3;n a realizar, y la segunda el objeto de esa acci&#xF3;n. Se sit&#xFA;a entre , que indican el comienzo y el fin del c&#xF3;digo, similarmente a los comentarios.</p>
<p>Aqu&#xED; s&#xF3;lo explicaremos el funcionamiento de &#x201C;include virtual&#x201D; y &#x201C;exec cgi&#x201D;, que son con mucho los m&#xE1;s interesantes. Para &#x201C;echo var&#x201D; y otros tipos de SSI, puedes consultar (en ingl&#xE9;s) esta p&#xE1;gina.</p>
<p>1. Comandos &#x201C;include virtual&#x201D;.- La primera parte del c&#xF3;digo es #include virtual, y la segunda, la ruta a un archivo entrecomillada. Por ejemplo, . Aqu&#xED; le estamos diciendo al servidor que en el punto donde se encuentra este c&#xF3;digo nos incluya el contenido del documento &#x201C;header.txt&#x201D;, que se encuentra en el mismo nivel (en la misma carpeta) que la p&#xE1;gina actual. Si escribi&#xE9;ramos le ordenar&#xED;amos que incluyera el contenido de &#x201C;header.txt&#x201D;, que est&#xE1; en la carpeta &#x201C;cabeceras&#x201D;, situada en el mismo nivel de la p&#xE1;gina actual. A&#xF1;adiendo ../ al comienzo de la ruta del archivo, le indicamos al servidor que suba un nivel desde la p&#xE1;gina actual para encontrar la carpeta y/o documento referenciados. La ruta puede ser relativa al directorio ra&#xED;z, por ejemplo, . En este caso le estamos pidiendo al servidor que incluya en la p&#xE1;gina actual -h&#xE1;llese &#xE9;sta en el nivel en que se halle- el contenido de &#x201C;header.txt&#x201D;, documento que se halla en la carpeta &#x201C;cabeceras&#x201D;, la cual se encuentra a su vez en el primer nivel del directorio ra&#xED;z. Es el m&#xE9;todo m&#xE1;s pr&#xE1;ctico.</p>
<p>Este tipo de comandos es &#xFA;til, por ejemplo, para introducir en todas las p&#xE1;ginas de un sitio web la misma cabecera y el mismo pie, que s&#xF3;lo tendr&#xED;amos que escribir una vez. Y, de la misma manera, cuando quisi&#xE9;ramos modificarlos, ser&#xED;a suficiente con cambiar el c&#xF3;digo en esas dos p&#xE1;ginas de cabecera y pie para que los cambios se aplicaran a todo el sitio.</p>
<p>Tambi&#xE9;n se puede emplear el comando &#x201C;include&#x201D; para mostrar los contenidos generados por un script, lo que nos evita tener que modificar el contenido html del script para adaptarlo al aspecto de nuestras p&#xE1;ginas.</p>
<p>Supongamos que tenemos un script llamado weather.cgi, situado en la carpeta cgi-bin, cuya funci&#xF3;n es mostrar los datos meteorol&#xF3;gicos de los aeropuertos. Supongamos igualmente que para activar el script necesitamos llamarlo con el navegador a&#xF1;adiendo el c&#xF3;digo del aeropuerto, de esta manera: http://www.misitio.com/cgi-bin/weather.cgi?clave=LTCC. Si el autor del script no ha previsto ning&#xFA;n c&#xF3;digo html espec&#xED;fico, al introducir esa url nos aparecer&#xE1;n los datos &#x201C;pelados&#x201D;, en el cuerpo y el tipo de letra por defecto de nuestro navegador, sobre un fondo blanco. Para modificar su aspecto deber&#xED;amos incorporar al script el c&#xF3;digo html necesario, lo que puede ser un l&#xED;o considerable.</p>
<p>Pero tambi&#xE9;n podemos introducir en una p&#xE1;gina ya construida la l&#xED;nea . Veremos entonces que en ella aparecen los datos meteorol&#xF3;gicos del aeropuerto LTCC, &#x201C;envueltos&#x201D; en el c&#xF3;digo html de la p&#xE1;gina y en las etiquetas espec&#xED;ficas con que queramos &#x201C;vestir&#x201D; al SSI, por ejemplo, <b> y </b>, <span> y </span>, etc.</p>
<p>2. Comandos &#x201C;exec cgi&#x201D;.- La sintaxis es igual que en el caso anterior, pero sustituyendo &#x201C;#include virtual&#x201D; por &#x201C;#exec cgi&#x201D;. Este comando ordena al servidor que ejecute un script y que incluya los resultados de esa ejecuci&#xF3;n en el punto en que se halla el c&#xF3;digo. A diferencia del caso anterior, la variable no hay que a&#xF1;adirla a la ruta del script en la l&#xED;nea de c&#xF3;digo, sino a la url de la p&#xE1;gina .shtml. De esta manera, la misma p&#xE1;gina se mantiene &#x201C;envolviendo&#x201D; los resultados de cada ejecuci&#xF3;n del script.</p>
<p>Retomemos el ejemplo anterior para mostrar el funcionamiento de esta directiva. El comando &#x201C;include virtual&#x201D; requiere la ruta completa del script, m&#xE1;s la variable que queramos activar. Para mostrar el tiempo en diez aeropuertos, deberemos, pues, incluir diez SSI, cada uno con la variable correspondiente. Utilizando &#x201C;exec cgi&#x201D;, sin embargo, nos bastar&#xE1; introducir s&#xF3;lo una vez el SSI.</p>
<p>Digamos que hemos llamado a la p&#xE1;gina donde tenemos el SSI &#x201C;tiempo.shtml&#x201D;. El c&#xF3;digo del SSI ser&#xE1; simplemente . Para activar la ejecuci&#xF3;n, a&#xF1;adamos la variable antes mencionada a la url de la p&#xE1;gina, de esta manera: http://www.misitio.com/tiempo.shtml?clave=LTCC. Aparecer&#xE1;n los datos meteorol&#xF3;gicos del aeropuerto LTCC. Si luego llamamos a la url http://www.misitio.com/tiempo.shtml?clave=RTSB, tendremos el tiempo correspondiente al aeropuerto RTSB. Para activar las diferentes urls podemos utilizar una serie de enlaces o emplear un formulario javascript que nos pida introducir el c&#xF3;digo del aeropuerto.</p>
<p>Si el script es de un tipo que se activa simplemente introduciendo en el navegador su url, sin necesidad de variables a&#xF1;adidas, muy posiblemente (dependiendo de las configuraciones del servidor) ser&#xE1; lo mismo llamarlo con un comando del tipo &#x201C;include virtual&#x201D; que &#x201C;exec cgi&#x201D;.</p>
<p>Por &#xFA;ltimo, conviene a&#xF1;adir que ambas directivas funcionan con cgis en Perl, pero en el caso de las p&#xE1;ginas en PHP el caso es diferente. &#x201C;Include virtual&#x201D; funciona igual para mostrar el contenido de una p&#xE1;gina PHP (como de un archivo .html o .txt), pero &#x201C;exec cgi&#x201D; s&#xF3;lo activar&#xE1; un programa PHP si el servidor tiene instalada la versi&#xF3;n cgi de este lenguaje. En caso contrario s&#xF3;lo podr&#xE1;s activar el programa desde otra p&#xE1;gina PHP, con las directivas correspondientes.</p> </div> </article> <article class="post-13 post type-post status-publish format-standard has-post-thumbnail hentry category-noticias"> <header class="post-info"> <time class="post-time"> </time> <img width="700" src="http://contributing.md/wp-content/uploads/2019/09/077ab55046ce80eaf9a3ddea999597ca_XL-700x401.jpg" class="post-image wp-post-image" alt srcset="http://contributing.md/wp-content/uploads/2019/09/077ab55046ce80eaf9a3ddea999597ca_XL-700x401.jpg 700w, http://contributing.md/wp-content/uploads/2019/09/077ab55046ce80eaf9a3ddea999597ca_XL-300x172.jpg 300w, http://contributing.md/wp-content/uploads/2019/09/077ab55046ce80eaf9a3ddea999597ca_XL-768x439.jpg 768w, http://contributing.md/wp-content/uploads/2019/09/077ab55046ce80eaf9a3ddea999597ca_XL.jpg 900w" sizes="(max-width: 700px) 100vw, 700px"> </header> <div class="post-content"> <p>Mientras lleves poco tiempo con tu sitio, y el n&#xFA;mero de visitas que recibas no sea muy elevado, todo ser&#xE1; paz y tranquilidad en tu casa. Pero espera unos meses, y comienza a alegrarte cuando los visitantes suban a 100 o 200 diarios, y las p&#xE1;ginas servidas a 500, 1.000 o 2.000. &#xC9;chale una mirada entonces a los registros (&#x201C;logs&#x201D;) del servidor, en concreto al de errores. De repente descubrir&#xE1;s que, donde antes s&#xF3;lo hab&#xED;a el registro de los ocasionales errores causados por ti mismo al escribir mal un enlace o al configurar un script deficientemente, aparecen montones de mensajes que te cuentan que alguien ha intentado acceder a determinado archivo sin conseguirlo. El mensaje que ver&#xE1;s m&#xE1;s repetido refiere que no se ha encontrado un archivo llamado &#x201C;robots.txt&#x201D;. Un buen momento, pues, para crearlo.</p>
<p>Se trata simplemente de un archivo de texto plano cuyo objetivo es orientar a los indexadores autom&#xE1;ticos (robots, spiders) sobre qu&#xE9; carpetas pueden indexar y cu&#xE1;les no. El trabajo de estos robots, en principio, es positivo: nos evitan tener que andar por ah&#xED; dando manualmente de alta nuestros sitios en todos los buscadores. Google es uno de los ejemplos m&#xE1;s conocidos. Pero no s&#xF3;lo indexan las p&#xE1;ginas principales (&#x201C;index&#x201D;), sino todas las del sitio y, si nos descuidamos, hasta los listados de usuarios de los foros o de las listas de correo y las bases de datos vinculadas a nuestros scripts.</p>
<p>Para evitar que estos indexadores metan las narices en lo que no les importa es necesario incluir en el directorio ra&#xED;z el documento robots.txt. Cr&#xE9;alo con cualquier editor de texto simple, pero que permita guardar el archivo con los saltos de l&#xED;nea en formato Unix. O aseg&#xFA;rate, en todo caso, de que el programa FTP con que vayas a subir ese archivo al servidor hace autom&#xE1;ticamente la correspondiente conversi&#xF3;n. Escribe en &#xE9;l algo como esto:</p>
<blockquote><p>User-agent: *
Disallow: /cgi-bin/
Disallow: /foro/</p><p>
Disallow: /anuncios/</p></blockquote></div></article></p>
<p>De esta manera est&#xE1;s diciendo a todos los robots (el * que sigue a &#x201C;user-agent&#x201D; indica &#x201C;todos&#x201D;) que no indexe tu directorio cgi-bin, ni el llamado &#x201C;foro&#x201D;, ni &#x201C;anuncios&#x201D;. Para evitar que indexe una p&#xE1;gina en concreto situada en el primer nivel del directorio p&#xFA;blico, escribe:</p>
<p>Disallow: paginatal.htm</p>
<p>Si quieres evitar el acceso de un robot en concreto, por ejemplo el de Google, escribe:</p>
<p>User-agent: googlebot</p>
<p>Y para impedir el acceso a todo tu sitio, pon simplemente:</p>
<blockquote><p>Disallow: /</p></blockquote>
<p>En el sitio SearchEngineWorld encontrar&#xE1;s un tutorial m&#xE1;s detallado y otra informaci&#xF3;n relacionada en ingl&#xE9;s, y tambi&#xE9;n un validador de archivos que te dir&#xE1; si tu robots.txt est&#xE1; configurado correctamente. Tambi&#xE9;n te explicar&#xE1; la sintaxis de las etiquetas META destinadas a impedir que los robots indexen determinadas p&#xE1;ginas, &#xFA;tiles cuando no se puede acceder al servidor para configurar un archivo robots.txt.</p>
<p>Pero tambi&#xE9;n hay robots &#x201C;malos&#x201D;</p>
<p>Sin embargo, debemos ser conscientes de que no todos los robots van a hacer caso de esas instrucciones. En concreto, hay unas malditas &#x201C;ara&#xF1;as&#x201D; recolectoras de direcciones de email que est&#xE1;n programadas para hacer caso omiso del contenido de robots.txt. Ellas van recogiendo todo lo que lleve en medio una @, y luego sus amos elaboran unas enormes listas de emails que venden a los spameros.</p>
<p>Quiz&#xE1;s no podremos evitar que sigan buceando en nuestros servidores, pero cuando menos tenemos a nuestro alcance una peque&#xF1;a venganza: regalarles con miles de direcciones falsas. Si sus bases de datos se contaminan, perder&#xE1;n valor ante los eventuales compradores y, al ocasionar aludes de rebotes en los servidores de emails an&#xF3;nimos (los que mayoritariamente utilizan los spameros), contribuiremos a combatir estas pr&#xE1;cticas. Hay algunos cgis gratuitos que realizan esto, como Killspam, que hemos traducido y ofrecemos en la secci&#xF3;n &#x201C;Scripts&#x201D;. All&#xED; encontrar&#xE1;s informaci&#xF3;n completa al respecto.</p> <article class="post-10 post type-post status-publish format-standard has-post-thumbnail hentry category-noticias"> <header class="post-info"> <time class="post-time"> </time> <img width="630" src="http://contributing.md/wp-content/uploads/2019/09/1869.jpg" class="post-image wp-post-image" alt srcset="http://contributing.md/wp-content/uploads/2019/09/1869.jpg 630w, http://contributing.md/wp-content/uploads/2019/09/1869-300x214.jpg 300w" sizes="(max-width: 630px) 100vw, 630px"> </header> <div class="post-content"> <p>C&#xF3;digo Libre es un proyecto surgido de la experiencia reunida por el gabinete 4Clics.com en el aprovechamiento de los recursos gratuitos generados por la amplia red de creadores de scripts. Su actividad ha generado un ingente fondo de programas de gran utilidad para los webmasters a la hora de dotar de contenido din&#xE1;mico a los sitios y facilitar su gesti&#xF3;n. Por desgracia, el material disponible en castellano es muy escaso, ya que la absoluta mayor&#xED;a han sido realizados en ingl&#xE9;s, y las traducciones corren a cargo de voluntarios que principalmente centran su atenci&#xF3;n en programas estrella, que pueden exceder las necesidades de los sitios de tipo mediano o peque&#xF1;o.</p>
<p>C&#xF3;digo Libre pretende compensar este vac&#xED;o de traducciones aportando sus propias versiones de otros programas de menor proyecci&#xF3;n, aunque de similar calidad y de no menor utilidad para tareas espec&#xED;ficas. Nuestro trabajo no ha consistido tan s&#xF3;lo en traducir, sino tambi&#xE9;n en adaptar y revisar los c&#xF3;digos.</p>
<p>Junto a ello, presentamos otros servicios de inter&#xE9;s para los webmasters como redireccionamiento de URLs, intercambio de banners y un espacio jur&#xED;dico dedicado a difundir los problemas legales vinculados a la actividad de Internet. Asimismo se incluye una secci&#xF3;n de tutoriales sobre aspectos no suficientemente popularizados de la construcci&#xF3;n de sitios web y un &#xED;ndice de sitios y libros abierto a las aportaciones de nuestros visitantes.</p>
<p>Los scripts disponibles se encuentran rese&#xF1;ados en la secci&#xF3;n &#x201C;Scripts&#x201D;, de donde se pueden descargar libremente. Los c&#xF3;digos se presentan en dos versiones: para ordenadores Macintosh (en formato comprimido .sit) y para el sistema operativo Windows (en formato .zip). Esto se ha hecho as&#xED; para evitar los problemas derivados del diferente m&#xE9;todo de codificar los retornos de carro (linebreaks) en ambos sistemas, que puede ocasionar una corrupci&#xF3;n del c&#xF3;digo al abrir un documento de texto creado en el otro sistema, y a causa de las distintas codificaciones de los caracteres especiales como los acentos y las &#x201C;&#xF1;&#x201D;.</p>
<p><b><i>Requerimientos m&#xED;nimos.&#x2013;</i></b> Para instalar y trabajar con scripts necesitas:</p>
<ol>
<li>Poder <b>acceder a tu servidor v&#xED;a FTP</b>, y por tanto, una cierta familiaridad con las entretelas de los servidores y con los programas de este tipo: c&#xF3;mo otorgar permisiones (CHMOD), c&#xF3;mo subir archivos en formato ASCII/texto o binario, c&#xF3;mo se organizan los directorios de tu servidor, qu&#xE9; son las rutas del servidor y c&#xF3;mo conocerlas.</li>
<li>Un servidor que admita el <b>lenguaje PHP y el Perl.</b> Asimismo, es muy recomendable que accepte SSI (server side includes).</li>
<li>Disponer de un <b>programa de edici&#xF3;n de texto</b> (no Word o cualquier otro que trabaje con texto formateado, sino SimpleText o BBEdit para Mac, y NotePad para Windows) por si te conviene echar una mirada a los c&#xF3;digos y cambiar alguna cosa.</li>
<li><b>D</b><b>ominar el ingl&#xE9;s</b> a un nivel elemental. Nuestras traducciones cubren todos los textos que se muestran al visitante de una web, los de administraci&#xF3;n y lo fundamental de las instrucciones para instalar los scripts, pero no obligatoriamente el contenido completo de &#xE9;stas.</li>
<li>Y por supuesto, <b>dominar los elementos b&#xE1;sicos del lenguaje HTML.</b></li>
</ol>
<p><b><i>Condiciones de utilizaci&#xF3;n.&#x2013;</i></b> Las exigencias de los creadores en cuanto a la utilizaci&#xF3;n de sus scripts se ajustan aproximadamente a los principios de la OSI (Open Source Initiative, iniciativa del c&#xF3;digo abierto, cuyas caracter&#xED;sticas puedes consultar aqu&#xED;, en ingl&#xE9;s) o de la GNU General Public License (que puedes consultar aqu&#xED;, en ingl&#xE9;s).</p>
<p>Se trata en esencia de garantizar el uso, la redistribuci&#xF3;n y la modificaci&#xF3;n libres del software. El creador o creadores de un programa acostumbran a pedir que se respeten sus copyrights manteniendo los cr&#xE9;ditos situados al comienzo o al final de los c&#xF3;digos. Pueden solicitar tambi&#xE9;n la inclusi&#xF3;n de una referencia a su autor&#xED;a en la p&#xE1;gina web que utiliza el script, junto a un enlace a su propio sitio. El uso gratuito del software se permite en unos casos con car&#xE1;cter general, y en otros s&#xF3;lo cuando la web que los emplea no tiene finalidades comerciales. Para todos estos detalles debes consultar las instrucciones de instalaci&#xF3;n o el encabezamiento de los scripts.</p>
<p>Por nuestra parte, s&#xF3;lo pedimos el mantenimiento de las referencias a nuestro trabajo de traductores y adaptadores en los encabezamientos de los c&#xF3;digos, aunque agradeceremos tambi&#xE9;n un enlace a este sitio.</p>
<p><b><i> Aviso.&#x2013;</i></b> Dado el car&#xE1;cter gratuito de estos programas, ni sus creadores ni C&#xF3;digo Libre se hacen responsables de las disfunciones o la ocasional p&#xE9;rdida de informaci&#xF3;n provocada por su uso. C&#xF3;digo Libre, por su parte, y aunque ha verificado el uso de los scripts rese&#xF1;ados, tampoco garantiza la absoluta inexistencia de errores ni en el c&#xF3;digo original ni en sus propias adaptaciones, cuya notificaci&#xF3;n, en todo caso, agradecer&#xE1; vivamente.</p> </div> </article> <nav class="posts-navigation"> </nav> </div>
</div>
    </div>
    <footer>
        <div>created by buildstarted &copy; 2019 <a href="/about">about</a></div>
        <div>Share this page on social media: copy and paste this url https://linksfor.dev/</div>
    </footer>
    
    <script>
        (function() {
            var COLLECT_URL = "https://dna.buildstarted.com/t";
            var SITE_ID = "linksfor.devs";
            var GLOBAL_VAR_NAME = "__DNA__";

            window[GLOBAL_VAR_NAME] = {};

            window[GLOBAL_VAR_NAME].sendPageView = function() {
                var path = location.pathname;
                var referrer = document.referrer;

                var url = COLLECT_URL + "?siteid=" + SITE_ID + "&p=" + encodeURIComponent(path) + "&r=" + encodeURIComponent(referrer);

                try { fetch(url, { method: "GET" }); } catch (e) {}
            };

            window[GLOBAL_VAR_NAME].sendPageView();
        })();
    </script>
</body>
</html>