<!DOCTYPE html>
<html lang="en">
<head>
    <title>
pixiv&#x306B;&#x8106;&#x5F31;&#x306A;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3067;&#x767B;&#x9332;&#x3067;&#x304D;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x3057;&#x307E;&#x3057;&#x305F; -
linksfor.dev(s)
    </title>
	<link rel="alternate" type="application/rss+xml" title="Linksfor.dev(s) feed" href="https://linksfor.dev/feed.rss" />
    <meta charset="utf-8">
    <meta name="Description" content="A curated source of links that devs might find interesting. Updated around the clock." />
    <meta name="google" value="notranslate">
    <link rel="stylesheet" type="text/css" href="/style.css" />
</head>
<body>
    <div class="grid">
        
<div class="readable">
    <h1>pixiv&#x306B;&#x8106;&#x5F31;&#x306A;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3067;&#x767B;&#x9332;&#x3067;&#x304D;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x3057;&#x307E;&#x3057;&#x305F;</h1>
    <div class="entry-content"> <p><figure class="figure-image figure-image-fotolife"><span><img src="https://cdn-ak.f.st-hatena.com/images/fotolife/p/pxvpxv/20200120/20200120162946.png" alt="f:id:pxvpxv:20200120162946p:plain" class="hatena-fotolife"></span><figcaption>&#x56F3;1: &#x8106;&#x5F31;&#x306A;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x5165;&#x529B;&#x3057;&#x305F;&#x5834;&#x5408;&#x306E;&#x30A8;&#x30E9;&#x30FC;&#x753B;&#x9762;</figcaption></figure></p> <p>&#x3053;&#x3093;&#x306B;&#x3061;&#x306F;&#x3001;pixiv&#x958B;&#x767A;&#x652F;&#x63F4;&#x30C1;&#x30FC;&#x30E0;&#x306E;mipsparc&#x3067;&#x3059;&#x3002;</p> <p>&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3001;&#x3082;&#x3057;&#x304B;&#x3057;&#x3066;&#x4F7F;&#x3044;&#x307E;&#x308F;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x304B;?
&#x8907;&#x6570;&#x306E;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3067;&#x540C;&#x3058;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x3044;&#x308B;&#x3068;&#x3001;&#x300C;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x30EA;&#x30B9;&#x30C8;&#x578B;&#x653B;&#x6483;&#x300D;&#x306B;&#x3088;&#x3063;&#x3066;&#x4E0D;&#x6B63;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x306E;&#x88AB;&#x5BB3;&#x3092;&#x53D7;&#x3051;&#x3066;&#x3057;&#x307E;&#x3046;&#x304B;&#x3082;&#x3057;&#x308C;&#x307E;&#x305B;&#x3093;&#x3002;
&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x30EA;&#x30B9;&#x30C8;&#x578B;&#x653B;&#x6483;&#x306E;&#x88AB;&#x5BB3;&#x306B;&#x3042;&#x308F;&#x306A;&#x3044;&#x305F;&#x3081;&#x306B;&#x306F;&#x3001;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x3084;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x7BA1;&#x7406;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x81EA;&#x52D5;&#x751F;&#x6210;&#x3055;&#x308C;&#x305F;&#x5B89;&#x5168;&#x306A;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x5229;&#x7528;&#x3059;&#x308B;&#x306E;&#x304C;&#x597D;&#x307E;&#x3057;&#x3044;&#x3067;&#x3059;&#x3002;</p> <p>&#x3057;&#x304B;&#x3057;&#x3001;&#x5B9F;&#x969B;&#x306B;&#x306F;&#x591A;&#x304F;&#x306E;&#x4EBA;&#x304C;&#x300C;&#x4F7F;&#x3044;&#x307E;&#x308F;&#x3057;&#x305F;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x300D;&#x3084;&#x300C;&#x7C21;&#x5358;&#x306A;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x300D;(&#x4EE5;&#x4E0B;&#x3001;&#x8106;&#x5F31;&#x306A;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;)&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3057;&#x3001;&#x5553;&#x8499;&#x6D3B;&#x52D5;&#x306B;&#x3082;&#x9650;&#x754C;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;
pixiv&#x3067;&#x306F;&#x30B5;&#x30A4;&#x30D0;&#x30FC;&#x653B;&#x6483;&#x3078;&#x306E;&#x5BFE;&#x7B56;&#x3092;&#x8907;&#x6570;&#x3068;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x304C;&#x3001;&#x6839;&#x672C;&#x7684;&#x306A;&#x5BFE;&#x7B56;&#x306E;&#x3072;&#x3068;&#x3064;&#x3068;&#x3057;&#x3066;&#x3001;&#x8106;&#x5F31;&#x306A;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x65B0;&#x3057;&#x304F;&#x8A2D;&#x5B9A;&#x3067;&#x304D;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;</p> <h3>&#x8106;&#x5F31;&#x306A;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x5224;&#x5B9A;&#x65B9;&#x6CD5;</h3> <p>&#x8106;&#x5F31;&#x306A;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x5229;&#x7528;&#x306F;&#x3069;&#x306E;&#x3088;&#x3046;&#x306B;&#x9632;&#x3050;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x304B;&#xFF1F;</p> <p>&#x597D;&#x307E;&#x3057;&#x304F;&#x306A;&#x3044;&#x65B9;&#x6CD5;&#x3068;&#x3057;&#x3066;&#x306F;&#x3001;&#x300C;&#x82F1;&#x6570;&#x5B57;&#x3001;&#x5927;&#x6587;&#x5B57;&#x5C0F;&#x6587;&#x5B57;&#x8A18;&#x53F7;&#x3059;&#x3079;&#x3066;&#x3092;&#x542B;&#x3080;&#x300D;&#x3068;&#x3044;&#x3063;&#x305F;&#x5236;&#x9650;&#x3092;&#x8A2D;&#x3051;&#x308B;&#x65B9;&#x6CD5;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3057;&#x304B;&#x3057;&#x3001;&#x3053;&#x308C;&#x3067;&#x306F;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x4F7F;&#x3044;&#x56DE;&#x3057;&#x306E;&#x9632;&#x6B62;&#x306B;&#x306F;&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x307E;&#x305F;&#x3001;&#x4ED5;&#x65B9;&#x306A;&#x304F;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x672B;&#x5C3E;&#x306B;&#x300C;1&#x300D;&#x306A;&#x3069;&#x3092;&#x3064;&#x3051;&#x3066;&#x3053;&#x306E;&#x5236;&#x9650;&#x3092;&#x56DE;&#x907F;&#x3057;&#x3066;&#x3057;&#x307E;&#x3046;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x3082;&#x3044;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;
&#x307B;&#x304B;&#x306E;&#x4E00;&#x822C;&#x7684;&#x306A;&#x65B9;&#x6CD5;&#x3068;&#x3057;&#x3066;&#x306F;&#x3001;&#x8F9E;&#x66F8;&#x306B;&#x8F09;&#x3063;&#x3066;&#x3044;&#x308B;&#x5358;&#x8A9E;&#x3084;&#x30AD;&#x30FC;&#x914D;&#x7F6E;&#x306A;&#x3069;&#x304B;&#x3089;&#x63A8;&#x6E2C;&#x3067;&#x304D;&#x308B;&#x5358;&#x8A9E;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x3092;&#x4F5C;&#x6210;&#x3057;&#x3066;&#x5236;&#x9650;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3042;&#x308B;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;&#x3053;&#x3061;&#x3089;&#x306F;&#x7C21;&#x5358;&#x306A;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x9632;&#x6B62;&#x3059;&#x308B;&#x306E;&#x306B;&#x306F;&#x6709;&#x52B9;&#x306A;&#x65B9;&#x6CD5;&#x3067;&#x3059;&#x304C;&#x3001;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x4F7F;&#x3044;&#x56DE;&#x3057;&#x306E;&#x9632;&#x6B62;&#x306B;&#x306F;&#x306A;&#x308A;&#x307E;&#x305B;&#x3093;&#x3057;&#x3001;&#x30EA;&#x30B9;&#x30C8;&#x3092;&#x7DB2;&#x7F85;&#x7684;&#x306B;&#x4F5C;&#x6210;&#x3059;&#x308B;&#x306E;&#x306F;&#x56F0;&#x96E3;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;</p> <p>&#x4ECA;&#x56DE;&#x306F;&#x5148;&#x9032;&#x7684;&#x306A;&#x53D6;&#x308A;&#x7D44;&#x307F;&#x3068;&#x3057;&#x3066;&#x3001;&#x904E;&#x53BB;&#x306B;&#x4ED6;&#x306E;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3067;&#x6F0F;&#x6D29;&#x6E08;&#x307F;&#x3068;&#x3057;&#x3066;&#x516C;&#x958B;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3001;&#x30CF;&#x30C3;&#x30B7;&#x30E5;&#x5316;<a href="#f-cd2b1c1b">*1</a>&#x3055;&#x308C;&#x305F;&#x6F0F;&#x6D29;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x307E;&#x3057;&#x305F;&#x3002;&#x3053;&#x306E;&#x65B9;&#x6CD5;&#x306F;&#x3001;&#x5B9F;&#x969B;&#x306B;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306B;&#x4F7F;&#x308F;&#x308C;&#x3066;&#x3044;&#x308B;&#x300C;&#x751F;&#x304D;&#x305F;&#x300D;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x306A;&#x306E;&#x3067;&#x3001;&#x7DB2;&#x7F85;&#x6027;&#x304C;&#x3042;&#x308B;&#x70B9;&#x3067;&#x512A;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x307E;&#x305F;&#x3001;1&#x4EBA;&#x304C;&#x8907;&#x6570;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3067;&#x4F7F;&#x3044;&#x307E;&#x308F;&#x3057;&#x3066;&#x3044;&#x308B;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306A;&#x3069;&#x3082;&#x63B2;&#x8F09;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x305F;&#x3081;&#x3001;&#x4F7F;&#x3044;&#x56DE;&#x3057;&#x306E;&#x9632;&#x6B62;&#x306B;&#x3082;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p> <p>&#x30CF;&#x30C3;&#x30B7;&#x30E5;&#x5316;&#x3055;&#x308C;&#x305F;&#x6F0F;&#x6D29;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x306F;&#x300C;Have I Been Pwned&#x300D;(&#x4EE5;&#x4E0B;HIBP)&#x3068;&#x3044;&#x3046;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306B;&#x3088;&#x308A;&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x306E;&#x5411;&#x4E0A;&#x306E;&#x305F;&#x3081;&#x306B;&#x975E;&#x55B6;&#x5229;&#x3067;&#x63D0;&#x4F9B;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p> <p><cite class="hatena-citation"><a href="https://haveibeenpwned.com/Passwords">haveibeenpwned.com</a></cite></p> <p>&#x6F0F;&#x6D29;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x4FDD;&#x6709;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x3064;&#x3044;&#x3066;&#x306E;&#x9055;&#x6CD5;&#x6027;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x3001;&#x4E0D;&#x6B63;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x7981;&#x6B62;&#x6CD5;(&#x4E0D;&#x6B63;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x884C;&#x70BA;&#x306E;&#x7981;&#x6B62;&#x7B49;&#x306B;&#x95A2;&#x3059;&#x308B;&#x6CD5;&#x5F8B;)&#x7B2C;6&#x6761;&#x306B;&#x300C;&#x4F55;&#x4EBA;&#x3082;&#x3001;&#x4E0D;&#x6B63;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x884C;&#x70BA;&#x306E;&#x7528;&#x306B;&#x4F9B;&#x3059;&#x308B;&#x76EE;&#x7684;&#x3067;&#x3001;&#x4E0D;&#x6B63;&#x306B;&#x53D6;&#x5F97;&#x3055;&#x308C;&#x305F;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x5236;&#x5FA1;&#x6A5F;&#x80FD;&#x306B;&#x4FC2;&#x308B;&#x4ED6;&#x4EBA;&#x306E;&#x8B58;&#x5225;&#x7B26;&#x53F7;&#x3092;&#x4FDD;&#x7BA1;&#x3057;&#x3066;&#x306F;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;&#x300D;&#x3068;&#x3042;&#x308A;&#x3001;&#x5B89;&#x5168;&#x78BA;&#x4FDD;&#x76EE;&#x7684;&#x3067;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x4FDD;&#x6301;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x554F;&#x984C;&#x306F;&#x306A;&#x3044;&#x3068;&#x89E3;&#x91C8;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p> <p>HIBP&#x304B;&#x3089;&#x63D0;&#x4F9B;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x30CF;&#x30C3;&#x30B7;&#x30E5;&#x5316;&#x3055;&#x308C;&#x305F;&#x6F0F;&#x6D29;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x306B;&#x306F;&#x3001;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306E;SHA-1&#x30CF;&#x30C3;&#x30B7;&#x30E5;&#x5024;&#x3068;&#x3001;&#x305D;&#x306E;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x904E;&#x53BB;&#x306B;&#x6F0F;&#x6D29;&#x3057;&#x305F;&#x56DE;&#x6570;&#x304C;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x56DE;&#x6570;&#x304C;&#x591A;&#x3044;&#x307B;&#x3069;&#x3088;&#x308A;&#x4E00;&#x822C;&#x7684;&#x3067;&#x5358;&#x7D14;&#x306A;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3060;&#x3068;&#x3044;&#x3046;&#x6307;&#x6A19;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x4EE5;&#x4E0B;&#x306B;&#x305D;&#x306E;&#x4F8B;&#x3092;&#x793A;&#x3057;&#x307E;&#x3059;&#x3002;</p> <pre class="code">C7A4D890AC7326FA165E590249D32C46498F49B1 : 23547453&#x56DE;
7F3CCBD108E84037A2FD769956CC3CC47AEA4314 : 7799814&#x56DE;
1B3B77A3500CDE106787A7F45147FF00577F25E1 : 3912816&#x56DE;
B5AA164E9C9BF3F3602852B0C68F33B1E76EF88D : 3730471&#x56DE;
D3F4B20FD71CEB832BC06D4E96941A70F1D9E0D3 : 3120735&#x56DE;
C722F22B29D728A82FF29512438E39420836C7D0 : 2938594&#x56DE;</pre> <p>&#x30CF;&#x30C3;&#x30B7;&#x30E5;&#x5024;&#x3092;&#x6F0F;&#x6D29;&#x3057;&#x305F;&#x56DE;&#x6570;&#x3068;&#x3068;&#x3082;&#x306B;&#x30C7;&#x30FC;&#x30BF;&#x30D9;&#x30FC;&#x30B9;&#x306B;&#x683C;&#x7D0D;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;&#x6F0F;&#x6D29;&#x56DE;&#x6570;&#x304C;&#x591A;&#x3044;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x304B;&#x3089;&#x6BB5;&#x968E;&#x7684;&#x306B;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x306A;&#x304F;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x306A;&#x304A;&#x3001;&#x57F7;&#x7B46;&#x6642;&#x6700;&#x65B0;&#x306E;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;5&#x3067;&#x306F;5&#x5104;5&#x5343;&#x4E07;&#x4EF6;&#x7A0B;&#x5EA6;&#x306E;&#x30CF;&#x30C3;&#x30B7;&#x30E5;&#x5024;&#x304C;&#x542B;&#x307E;&#x308C;&#x3066;&#x304A;&#x308A;&#x3001;&#x60C5;&#x5831;&#x91CF;&#x304C;&#x5927;&#x304D;&#x3044;&#x306E;&#x3067;&#x53D6;&#x308A;&#x6271;&#x3044;&#x306B;&#x306F;&#x6CE8;&#x610F;&#x304C;&#x5FC5;&#x8981;&#x3067;&#x3059;&#x3002;pixiv&#x3067;&#x306F;&#x904B;&#x7528;&#x3068;&#x306E;&#x517C;&#x306D;&#x5408;&#x3044;&#x304B;&#x3089;&#x3001;&#x4E00;&#x5B9A;&#x306E;&#x6F0F;&#x6D29;&#x56DE;&#x6570;&#x4EE5;&#x4E0A;&#x306E;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x307F;&#x3092;&#x30C7;&#x30FC;&#x30BF;&#x30D9;&#x30FC;&#x30B9;&#x306B;&#x683C;&#x7D0D;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p> <h3>&#x5148;&#x884C;&#x4E8B;&#x4F8B;</h3> <p>Python&#x306E;&#x30BD;&#x30D5;&#x30C8;&#x30A6;&#x30A7;&#x30A2;&#x30EA;&#x30DD;&#x30B8;&#x30C8;&#x30EA;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;PyPI&#x3067;&#x306F;&#x3001;&#x3059;&#x3067;&#x306B;HIBP&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x6F0F;&#x6D29;&#x3057;&#x305F;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x3044;&#x308B;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x306B;&#x544A;&#x77E5;&#x3059;&#x308B;&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x5BFE;&#x7B56;&#x3092;&#x884C;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p> <p>&#x307E;&#x305F;&#x3001;Google &#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9; &#x30DE;&#x30CD;&#x30FC;&#x30B8;&#x30E3;&#x30FC;&#x306B;&#x3082;&#x3001;&#x4FDD;&#x5B58;&#x3055;&#x308C;&#x305F;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x4E0D;&#x6B63;&#x5229;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x304B;&#x3092;&#x78BA;&#x8A8D;&#x3059;&#x308B;&#x6A5F;&#x80FD;&#x304C;&#x3042;&#x308A;&#x3001;&#x540C;&#x69D8;&#x306B;&#x6F0F;&#x6D29;&#x3057;&#x305F;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x6D3B;&#x7528;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p> <h3>&#x3053;&#x306E;&#x53D6;&#x308A;&#x7D44;&#x307F;&#x306E;&#x6839;&#x62E0;</h3> <p>NIST(&#x30A2;&#x30E1;&#x30EA;&#x30AB;&#x56FD;&#x7ACB;&#x6A19;&#x6E96;&#x6280;&#x8853;&#x7814;&#x7A76;&#x6240;)&#x306F;&#x3001;&#x6587;&#x66F8;SP 800-63B&#x300C;Digital Identity Guidelines: Authentication and Lifecycle Management&#x300D;&#x5185;&#x306E;&#x300C;5.1.1.2 Memorized Secret Verifiers&#x300D;(&#x3044;&#x308F;&#x3086;&#x308B;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306B;&#x76F8;&#x5F53;&#x3059;&#x308B;)&#x306B;&#x3064;&#x3044;&#x3066;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x898B;&#x89E3;&#x3092;&#x793A;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;(&#x539F;&#x6587;&#x304B;&#x3089;&#x7FFB;&#x8A33;&#x30FB;&#x8981;&#x7D04;)</p> <blockquote>
<ul>
<li>&#x904E;&#x53BB;&#x306E;&#x6F0F;&#x6D29;&#x4E8B;&#x6848;&#x306B;&#x3088;&#x308A;&#x5165;&#x624B;&#x3057;&#x305F;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;</li>
<li>&#x8F9E;&#x66F8;&#x306B;&#x3042;&#x308B;&#x5358;&#x8A9E;</li>
<li>&#x7E70;&#x308A;&#x8FD4;&#x3057;&#x305F;&#x308A;&#x9806;&#x756A;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x6587;&#x5B57;&#x5217;(<code>aaaaaa</code>&#x3084;<code>1234abcd</code>&#x306A;&#x3069;)</li>
<li>&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x540D;&#x3084;&#x30E6;&#x30FC;&#x30B6;&#x30FC;&#x540D;&#x306A;&#x3069;&#x3001;&#x63A8;&#x6E2C;&#x53EF;&#x80FD;&#x306A;&#x5358;&#x8A9E;</li>
</ul>
<p>&#x306A;&#x3069;&#x306B;&#x5165;&#x529B;&#x3055;&#x308C;&#x305F;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x5408;&#x81F4;&#x3057;&#x305F;&#x5834;&#x5408;&#x306F;&#x62D2;&#x7D76;&#x3057;&#x3066;&#x3001;&#x305D;&#x306E;&#x7406;&#x7531;&#x3092;&#x4F1D;&#x3048;&#x308B;&#x3082;&#x306E;&#x3068;&#x3059;&#x308B;&#x3002;</p>
</blockquote> <p>&#x6F0F;&#x6D29;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x8A2D;&#x5B9A;&#x3067;&#x304D;&#x306A;&#x304F;&#x3059;&#x308B;&#x672C;&#x65BD;&#x7B56;&#x306F;&#x3053;&#x306E;&#x898B;&#x89E3;&#x306B;&#x6CBF;&#x3046;&#x3082;&#x306E;&#x3067;&#x3059;&#x3002;&#x306A;&#x304A;&#x3001;&#x300C;&#x8F9E;&#x66F8;&#x306B;&#x3042;&#x308B;&#x5358;&#x8A9E;&#x300D;&#x3084;&#x300C;&#x7E70;&#x308A;&#x8FD4;&#x3057;&#x305F;&#x308A;&#x9806;&#x756A;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x5358;&#x8A9E;&#x300D;&#x3082;&#x305D;&#x306E;&#x591A;&#x304F;&#x304C;&#x6F0F;&#x6D29;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306B;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x305F;&#x3081;&#x3001;&#x5225;&#x9014;&#x8FFD;&#x52A0;&#x3059;&#x308B;&#x3053;&#x3068;&#x306F;&#x3057;&#x3066;&#x3044;&#x307E;&#x305B;&#x3093;&#x3002;</p> <h3>&#x4ECA;&#x5F8C;&#x306E;&#x5C55;&#x671B;</h3> <p>&#x65B0;&#x898F;&#x8A2D;&#x5B9A;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x3001;&#x3059;&#x3067;&#x306B;&#x3054;&#x5229;&#x7528;&#x3044;&#x305F;&#x3060;&#x3044;&#x3066;&#x3044;&#x308B;&#x65B9;&#x306B;&#x3064;&#x3044;&#x3066;&#x3082;&#x8106;&#x5F31;&#x306A;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x9806;&#x6B21;&#x5909;&#x66F4;&#x3044;&#x305F;&#x3060;&#x304F;&#x53D6;&#x308A;&#x7D44;&#x307F;&#x3092;&#x9032;&#x3081;&#x3066;&#x3044;&#x304D;&#x305F;&#x3044;&#x3068;&#x8003;&#x3048;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;
&#x3055;&#x3089;&#x306B;&#x3001;FIDO&#x3084;&#x591A;&#x8981;&#x7D20;&#x8A8D;&#x8A3C;&#x3068;&#x3044;&#x3063;&#x305F;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x306B;&#x983C;&#x3089;&#x306A;&#x3044;&#x8A8D;&#x8A3C;&#x65B9;&#x6CD5;&#x306B;&#x3088;&#x308B;&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x5F37;&#x5316;&#x306B;&#x3064;&#x3044;&#x3066;&#x3082;&#x5BFE;&#x5FDC;&#x3057;&#x3066;&#x3044;&#x304F;&#x8A08;&#x753B;&#x3067;&#x3059;&#x3002;</p> <h3>&#x53C2;&#x8003;&#x30EA;&#x30F3;&#x30AF;</h3> <div class="profile-cards-list"> </div> </div>
</div>
    </div>
    <footer>
        <div>created by buildstarted &copy; 2020 <a href="/about">about</a></div>
        <div>Share this page on social media: copy and paste this url https://linksfor.dev/</div>
    </footer>
    
    <script>
        (function() {
            var COLLECT_URL = "https://dna.buildstarted.com/t";
            var SITE_ID = "linksfor.devs";
            var GLOBAL_VAR_NAME = "__DNA__";

            window[GLOBAL_VAR_NAME] = {};

            window[GLOBAL_VAR_NAME].sendPageView = function() {
                var path = location.pathname;
                var referrer = document.referrer;

                var url = COLLECT_URL + "?siteid=" + SITE_ID + "&p=" + encodeURIComponent(path) + "&r=" + encodeURIComponent(referrer);

                try { fetch(url, { method: "GET" }); } catch (e) {}
            };

            window[GLOBAL_VAR_NAME].sendPageView();
        })();
    </script>
</body>
</html>